{
  "<eos>": 0,
  "_": 1,
  "_k": 2,
  "_ka": 3,
  "_kaa": 4,
  "_kaam_": 5,
  "_kab": 6,
  "_kab_": 7,
  "_kabhī_": 8,
  "_kah": 9,
  "_kah_": 10,
  "_kahe_": 11,
  "_kahiye_": 12,
  "_kahte_haiñ_": 13,
  "_kahā": 14,
  "_kahā_": 15,
  "_kahāñ_": 16,
  "_kahīñ_": 17,
  "_kahūñ_": 18,
  "_kaise_": 19,
  "_kal_": 20,
  "_kam": 21,
  "_kam_": 22,
  "_kar": 23,
  "_kar_": 24,
  "_kar_chale_": 25,
  "_kar_ke_": 26,
  "_kare_": 27,
  "_kare_koī_": 28,
  "_kareñ_": 29,
  "_karnā_": 30,
  "_karo_": 31,
  "_karte_": 32,
  "_karte_haiñ_": 33,
  "_kartī_hai_": 34,
  "_karūñ_": 35,
  "_kaun_": 36,
  "_ke_": 37,
  "_ke_bhī_": 38,
  "_ke_dekh_": 39,
  "_ke_dekhte_haiñ_": 40,
  "_ke_k": 41,
  "_ke_liye_": 42,
  "_ke_saath_": 43,
  "_kh": 44,
  "_khil": 45,
  "_kho": 46,
  "_khu": 47,
  "_khul": 48,
  "_khul_": 49,
  "_khulā_": 50,
  "_khā": 51,
  "_khīñ": 52,
  "_ki": 53,
  "_ki_": 54,
  "_ki_maiñ_": 55,
  "_kidhar_": 56,
  "_kiije_": 57,
  "_kis": 58,
  "_kis_": 59,
  "_kis_ko_": 60,
  "_kis_kā_": 61,
  "_kis_kī_": 62,
  "_kis_ne_": 63,
  "_kis_tarah_": 64,
  "_kise_": 65,
  "_kisī": 66,
  "_kisī_": 67,
  "_kisī_ke_": 68,
  "_kisī_ko": 69,
  "_kisī_ko_": 70,
  "_kisī_kā_": 71,
  "_kisī_kī_": 72,
  "_kisī_se_": 73,
  "_kit": 74,
  "_kitne_": 75,
  "_kitnā_": 76,
  "_kitnī_": 77,
  "_kiye_": 78,
  "_kiyā": 79,
  "_kiyā_": 80,
  "_kiyā_hai_": 81,
  "_ko": 82,
  "_ko_": 83,
  "_ko_bhī_": 84,
  "_ko_kyā_": 85,
  "_koī_": 86,
  "_ku": 87,
  "_kuchh": 88,
  "_kuchh_": 89,
  "_kuuñ_": 90,
  "_kyuu": 91,
  "_kyuuñ_": 92,
  "_kyā": 93,
  "_kyā_": 94,
  "_kyā_hai_": 95,
  "_kyā_ho_": 96,
  "_kyā_kah": 97,
  "_kyā_kar": 98,
  "_kyūñkar_": 99,
  "_kā": 100,
  "_kā_": 101,
  "_kī": 102,
  "_kī_": 103,
  "_kī_hai_": 104,
  "_kī_k": 105,
  "_kī_taraf_": 106,
  "_kī_tarah_": 107,
  "_kū": 108,
  "a": 109,
  "a_": 110,
  "aa": 111,
  "aa_": 112,
  "aa_gayā_": 113,
  "aa_ke_": 114,
  "aab": 115,
  "aab_": 116,
  "aad": 117,
  "aadmī_": 118,
  "aae": 119,
  "aae_": 120,
  "aae_haiñ_": 121,
  "aag_": 122,
  "aage_": 123,
  "aah": 124,
  "aah_": 125,
  "aai": 126,
  "aaina_": 127,
  "aaj": 128,
  "aaj_": 129,
  "aalam_": 130,
  "aam_": 131,
  "aanā_": 132,
  "aap": 133,
  "aap_": 134,
  "aap_ko_": 135,
  "aar": 136,
  "aarzū_": 137,
  "aate_": 138,
  "aate_aate_": 139,
  "aatā_hai_": 140,
  "aatī_": 141,
  "aatī_hai_": 142,
  "aave_": 143,
  "aayā_": 144,
  "aañ": 145,
  "aañkh": 146,
  "aañkh_": 147,
  "aañsū_": 148,
  "aaī_": 149,
  "ab": 150,
  "ab_": 151,
  "ab_ke_": 152,
  "ab_tak_": 153,
  "ab_to_": 154,
  "ab_vo_": 155,
  "abhī_": 156,
  "abhī_k": 157,
  "abhī_to_": 158,
  "ach": 159,
  "achchh": 160,
  "achchhā_": 161,
  "achchhī_": 162,
  "ad": 163,
  "adā": 164,
  "adā_": 165,
  "af": 166,
  "afsur": 167,
  "afsā": 168,
  "agar_": 169,
  "agarche_": 170,
  "ah": 171,
  "ah_": 172,
  "ahde": 173,
  "ahle": 174,
  "ahā": 175,
  "ahā_": 176,
  "ahāñ": 177,
  "ahāñ_": 178,
  "ahī_": 179,
  "ahīñ_": 180,
  "ai": 181,
  "ai_": 182,
  "ai_dil_": 183,
  "ai_dost_": 184,
  "aise_": 185,
  "aisā_": 186,
  "aisī_": 187,
  "aisī_k": 188,
  "aj": 189,
  "ajab_": 190,
  "ajii": 191,
  "ajiib_": 192,
  "ak": 193,
  "ak_": 194,
  "akbar_": 195,
  "ake": 196,
  "akelā_": 197,
  "aksar_": 198,
  "al": 199,
  "al_": 200,
  "allā": 201,
  "allāh_": 202,
  "am": 203,
  "am_": 204,
  "an": 205,
  "andā": 206,
  "andāze": 207,
  "anju": 208,
  "anjā": 209,
  "ap": 210,
  "apne_": 211,
  "apnā": 212,
  "apnā_": 213,
  "apnī_": 214,
  "aq": 215,
  "ar": 216,
  "ar_": 217,
  "are_": 218,
  "arze": 219,
  "as": 220,
  "as_": 221,
  "asa": 222,
  "asad_": 223,
  "asar_": 224,
  "ash": 225,
  "ashk": 226,
  "ashk_": 227,
  "asī": 228,
  "at": 229,
  "at_": 230,
  "au": 231,
  "aun": 232,
  "aun_": 233,
  "aur": 234,
  "aur_": 235,
  "aur_bhī_": 236,
  "aur_hai_": 237,
  "avva": 238,
  "az": 239,
  "aza": 240,
  "azii": 241,
  "añd": 242,
  "añdhe": 243,
  "añg": 244,
  "aḳh": 245,
  "b": 246,
  "b_": 247,
  "b_hai_": 248,
  "b_meñ_": 249,
  "ba": 250,
  "ba_": 251,
  "baa": 252,
  "baad_": 253,
  "baaqī_": 254,
  "baaqī_hai_": 255,
  "baar_": 256,
  "baat": 257,
  "baat_": 258,
  "bach": 259,
  "bachā": 260,
  "bad": 261,
  "bada": 262,
  "badal": 263,
  "badal_": 264,
  "badan_": 265,
  "badlā_": 266,
  "bah": 267,
  "bahut_": 268,
  "bahut_hai_": 269,
  "bahā": 270,
  "bahār": 271,
  "bahār_": 272,
  "bai": 273,
  "baith": 274,
  "baithe_": 275,
  "baithe_haiñ_": 276,
  "baithā_": 277,
  "balā": 278,
  "balā_": 279,
  "ban": 280,
  "ban_": 281,
  "band_": 282,
  "bande": 283,
  "bane_": 284,
  "banā": 285,
  "banā_": 286,
  "banāyā_": 287,
  "bar": 288,
  "bar_": 289,
  "barqe": 290,
  "barā": 291,
  "bas": 292,
  "bas_": 293,
  "basar_": 294,
  "baski_": 295,
  "bat": 296,
  "bat_": 297,
  "batā": 298,
  "bayā": 299,
  "bayābāñ_": 300,
  "bayāñ_": 301,
  "baz": 302,
  "bazm_": 303,
  "bazm_meñ_": 304,
  "bazme": 305,
  "baġhair_": 306,
  "baḍ": 307,
  "baḍh": 308,
  "baḍā_": 309,
  "baḍī_": 310,
  "baḳh": 311,
  "baḳhsh": 312,
  "be": 313,
  "bea": 314,
  "bedā": 315,
  "begā": 316,
  "beka": 317,
  "beniyā": 318,
  "beqar": 319,
  "betā": 320,
  "bevafā": 321,
  "beḳhudī_": 322,
  "bh": 323,
  "bha": 324,
  "bhalā_": 325,
  "bhar": 326,
  "bhar_": 327,
  "bhe": 328,
  "bhu": 329,
  "bhuul_": 330,
  "bhuul_gayā_": 331,
  "bhā": 332,
  "bhī": 333,
  "bhī_": 334,
  "bhī_hai_": 335,
  "bhī_ho_": 336,
  "bhī_k": 337,
  "bhī_kuchh_": 338,
  "bhī_na_": 339,
  "bhī_nahīñ_": 340,
  "bhī_to_": 341,
  "bhū": 342,
  "bi": 343,
  "bich": 344,
  "bichhaḍ": 345,
  "bii": 346,
  "bik": 347,
  "bikhar_": 348,
  "bin_": 349,
  "bis": 350,
  "bo": 351,
  "bu": 352,
  "bujh": 353,
  "bul": 354,
  "bula": 355,
  "bulbu": 356,
  "burā": 357,
  "burā_": 358,
  "but": 359,
  "bā": 360,
  "bā_": 361,
  "bāb_": 362,
  "bābe": 363,
  "bād": 364,
  "bād_": 365,
  "bāda": 366,
  "bāde": 367,
  "bāl": 368,
  "bān_": 369,
  "bār": 370,
  "bār_": 371,
  "bāre": 372,
  "bāt": 373,
  "bāte": 374,
  "bāteñ_": 375,
  "bāz": 376,
  "bāñ": 377,
  "bāñ_": 378,
  "bāñdh": 379,
  "bī": 380,
  "bī_": 381,
  "bū": 382,
  "bū_": 383,
  "c": 384,
  "ch": 385,
  "ch_": 386,
  "cha": 387,
  "cha_": 388,
  "chaar_": 389,
  "chae": 390,
  "chai": 391,
  "chal": 392,
  "chal_": 393,
  "chale_": 394,
  "chalo_": 395,
  "chalā_": 396,
  "chaman": 397,
  "chaman_": 398,
  "chaman_meñ_": 399,
  "chand_": 400,
  "char": 401,
  "charā": 402,
  "charāġh_": 403,
  "charāġhe": 404,
  "chash": 405,
  "chashme": 406,
  "che_": 407,
  "cheh": 408,
  "chehra_": 409,
  "chehre_": 410,
  "chh": 411,
  "chh_": 412,
  "chha": 413,
  "chhe": 414,
  "chho": 415,
  "chhoḍ": 416,
  "chhoḍ_": 417,
  "chhoḍ_kar_": 418,
  "chhu": 419,
  "chhup": 420,
  "chhupā": 421,
  "chhupā_": 422,
  "chhā": 423,
  "chhī_": 424,
  "chii": 425,
  "chiiz_hai_": 426,
  "cho": 427,
  "chu": 428,
  "chuk": 429,
  "chukā_": 430,
  "chup_": 431,
  "chā": 432,
  "chā_": 433,
  "chāh": 434,
  "chāhe_": 435,
  "chāhiye_": 436,
  "chāhtā_hai_": 437,
  "chāra": 438,
  "chāñ": 439,
  "chāñd": 440,
  "chāñd_": 441,
  "chī": 442,
  "chī_": 443,
  "d": 444,
  "d_": 445,
  "d_hai_": 446,
  "d_ke_": 447,
  "d_kā_": 448,
  "d_kī_": 449,
  "d_meñ_": 450,
  "d_se_": 451,
  "d_thā_": 452,
  "da": 453,
  "da_": 454,
  "daa": 455,
  "daaġh_": 456,
  "dab": 457,
  "dae": 458,
  "daf": 459,
  "dag": 460,
  "dagī_": 461,
  "dah": 462,
  "dam": 463,
  "dam_": 464,
  "dame": 465,
  "dar": 466,
  "dar_": 467,
  "dard": 468,
  "dard_": 469,
  "darde": 470,
  "dare": 471,
  "dari": 472,
  "dariyā": 473,
  "dariyā_": 474,
  "darkār_hai_": 475,
  "daro": 476,
  "das": 477,
  "dash": 478,
  "daste": 479,
  "dau": 480,
  "daure": 481,
  "dda": 482,
  "de": 483,
  "de_": 484,
  "de_meñ_": 485,
  "degā_": 486,
  "dek": 487,
  "dekh": 488,
  "dekh_": 489,
  "dekh_kar_": 490,
  "dekh_ke_": 491,
  "dekhe_": 492,
  "dekhiye_": 493,
  "dekhnā_": 494,
  "dekho_": 495,
  "dekhte_": 496,
  "dekhte_haiñ_": 497,
  "dekhā": 498,
  "dekhā_": 499,
  "dekhī_": 500,
  "dekhūñ_": 501,
  "denā_": 502,
  "der_": 503,
  "deñ_": 504,
  "dh": 505,
  "dha": 506,
  "dhar": 507,
  "dhar_": 508,
  "dhaḍ": 509,
  "dho": 510,
  "dhu": 511,
  "dhuu": 512,
  "dhuup_": 513,
  "dhuāñ_": 514,
  "dhā": 515,
  "dhūñ": 516,
  "dhūñd": 517,
  "di": 518,
  "dii": 519,
  "dikh": 520,
  "dikhā": 521,
  "dikhāī_": 522,
  "dil": 523,
  "dil_": 524,
  "dil_hai_": 525,
  "dil_hī_": 526,
  "dil_ke_": 527,
  "dil_ko_": 528,
  "dil_kā_": 529,
  "dil_kī_": 530,
  "dil_meñ_": 531,
  "dil_ne_": 532,
  "dil_pe_": 533,
  "dil_se_": 534,
  "dile": 535,
  "dilā": 536,
  "dimā": 537,
  "din": 538,
  "din_": 539,
  "diy": 540,
  "diye_": 541,
  "diyā_": 542,
  "do": 543,
  "do_": 544,
  "donoñ_": 545,
  "dos": 546,
  "dost": 547,
  "dost_": 548,
  "du": 549,
  "dukh_": 550,
  "duni": 551,
  "duniyā": 552,
  "duniyā_": 553,
  "duniyā_meñ_": 554,
  "dush": 555,
  "dushman": 556,
  "dushman_": 557,
  "duu": 558,
  "duur_": 559,
  "duā": 560,
  "duā_": 561,
  "dā": 562,
  "dā_": 563,
  "dāe": 564,
  "dāman_": 565,
  "dār": 566,
  "dār_": 567,
  "dārī_": 568,
  "dāñ_": 569,
  "dāġh": 570,
  "dāġh_": 571,
  "dāġhe": 572,
  "dī": 573,
  "dī_": 574,
  "dīdae": 575,
  "dīdār_": 576,
  "dīvā": 577,
  "dīvāna_": 578,
  "dīvār": 579,
  "dīvār_": 580,
  "dū": 581,
  "e": 582,
  "e<eos>": 583,
  "e_": 584,
  "e_haiñ_": 585,
  "e_k": 586,
  "e_ki_": 587,
  "e_ko": 588,
  "e_koī_": 589,
  "e_kuchh_": 590,
  "e_kyā_": 591,
  "e_meñ_": 592,
  "egā_": 593,
  "egī_": 594,
  "eh": 595,
  "ehsā": 596,
  "ek": 597,
  "ek_": 598,
  "eti": 599,
  "etibār_": 600,
  "eñ_": 601,
  "eñ_ham_": 602,
  "eñge_": 603,
  "f": 604,
  "f_": 605,
  "fa": 606,
  "fai": 607,
  "faiz_": 608,
  "falak_": 609,
  "fan_": 610,
  "faqat_": 611,
  "faqī": 612,
  "far": 613,
  "far_": 614,
  "fare": 615,
  "fariyā": 616,
  "farmā": 617,
  "faro": 618,
  "farā": 619,
  "farāz_": 620,
  "fas": 621,
  "fas_": 622,
  "fasle": 623,
  "fasā": 624,
  "fat_": 625,
  "fazā": 626,
  "fazā_": 627,
  "fe": 628,
  "fi": 629,
  "fik": 630,
  "fikre": 631,
  "fil": 632,
  "fir": 633,
  "fir_": 634,
  "firā": 635,
  "firāq_": 636,
  "fit": 637,
  "fu": 638,
  "fur": 639,
  "fursa": 640,
  "fursat_": 641,
  "fuġhāñ_": 642,
  "fā": 643,
  "fā_": 644,
  "g": 645,
  "g_": 646,
  "ga": 647,
  "gae_": 648,
  "gah": 649,
  "gah_": 650,
  "gaiiñ_": 651,
  "gal_": 652,
  "galī_": 653,
  "galī_meñ_": 654,
  "gar": 655,
  "gar_": 656,
  "garche_": 657,
  "gard": 658,
  "garda": 659,
  "gardishe": 660,
  "gare": 661,
  "garebāñ_": 662,
  "gau": 663,
  "gayā": 664,
  "gayā<eos>": 665,
  "gayā_": 666,
  "gaī_": 667,
  "ge": 668,
  "ge_": 669,
  "gha": 670,
  "ghab": 671,
  "ghar": 672,
  "ghar_": 673,
  "ghar_meñ_": 674,
  "ghaḍ": 675,
  "gi": 676,
  "gil": 677,
  "gila_": 678,
  "gir": 679,
  "giraf": 680,
  "go": 681,
  "go_": 682,
  "goyā_": 683,
  "gu": 684,
  "guf": 685,
  "guftu": 686,
  "gul": 687,
  "gul_": 688,
  "gule": 689,
  "guli": 690,
  "gulsha": 691,
  "gulā": 692,
  "gum": 693,
  "gumāñ_": 694,
  "gunā": 695,
  "guz": 696,
  "guzar": 697,
  "guzar_": 698,
  "guzre_": 699,
  "guzrī_": 700,
  "gā": 701,
  "gā_": 702,
  "gār": 703,
  "gār_": 704,
  "gāñ_": 705,
  "gī": 706,
  "gī_": 707,
  "gū": 708,
  "h": 709,
  "h_": 710,
  "h_kā_": 711,
  "ha": 712,
  "ha_": 713,
  "haa": 714,
  "haae_": 715,
  "haal_": 716,
  "haath_": 717,
  "haath_meñ_": 718,
  "haañ_": 719,
  "hab": 720,
  "hab_": 721,
  "hai": 722,
  "hai<eos>": 723,
  "hai_": 724,
  "hai_aur_": 725,
  "hai_jo_": 726,
  "hai_k": 727,
  "hai_kabhī_": 728,
  "hai_ki_": 729,
  "hai_ki_jo_thā_": 730,
  "hai_koī_": 731,
  "hai_kuchh_": 732,
  "hai_kyā_": 733,
  "hai_mujhe_": 734,
  "hai_na_": 735,
  "hai_to_": 736,
  "hai_vo_": 737,
  "hai_ye_": 738,
  "haiñ<eos>": 739,
  "haiñ_": 740,
  "haiñ_ham_": 741,
  "haiñ_k": 742,
  "haiñ_ki_": 743,
  "hal": 744,
  "hal_": 745,
  "ham": 746,
  "ham_": 747,
  "ham_bhī_": 748,
  "ham_ko_": 749,
  "ham_ne_": 750,
  "ham_se_": 751,
  "ham_to_": 752,
  "hame": 753,
  "hameñ_": 754,
  "hamār": 755,
  "hamāre_": 756,
  "hamārā_": 757,
  "hamārī_": 758,
  "hamīñ_": 759,
  "han": 760,
  "han_": 761,
  "haq_": 762,
  "haqī": 763,
  "haqīqat_": 764,
  "har": 765,
  "har_": 766,
  "har_ek_": 767,
  "har_ik_": 768,
  "hare": 769,
  "hargi": 770,
  "hargiz_": 771,
  "harī": 772,
  "has": 773,
  "hash": 774,
  "hasrat_": 775,
  "hasrate": 776,
  "hast": 777,
  "hastī_": 778,
  "hat": 779,
  "hat_": 780,
  "hate": 781,
  "haus": 782,
  "hava": 783,
  "havas_": 784,
  "havā": 785,
  "havā_": 786,
  "havāe": 787,
  "hayā": 788,
  "hayāt_": 789,
  "haz": 790,
  "hazrate": 791,
  "hazār": 792,
  "hazār_": 793,
  "hañ": 794,
  "hañgā": 795,
  "hañs": 796,
  "haḍ": 797,
  "he": 798,
  "he_": 799,
  "heñ_": 800,
  "hi": 801,
  "hij": 802,
  "hijr_kī_": 803,
  "hijā": 804,
  "him": 805,
  "hir": 806,
  "hir_": 807,
  "hisā": 808,
  "hisāb_": 809,
  "hiy": 810,
  "hiye_": 811,
  "ho": 812,
  "ho_": 813,
  "ho_ga": 814,
  "ho_gae_": 815,
  "ho_gayā_": 816,
  "ho_gaī_": 817,
  "ho_gaī_hai_": 818,
  "ho_jaae_": 819,
  "ho_kar_": 820,
  "ho_ke_": 821,
  "ho_ki_": 822,
  "ho_to_": 823,
  "ho_yā_": 824,
  "hogā": 825,
  "hogā_": 826,
  "hogī_": 827,
  "hone_": 828,
  "honā_": 829,
  "hosh_": 830,
  "hote_": 831,
  "hote_haiñ_": 832,
  "hotā_": 833,
  "hotā_hai_": 834,
  "hotī_": 835,
  "hotī_hai_": 836,
  "hoñ": 837,
  "hoñ_": 838,
  "hoñge_": 839,
  "hu": 840,
  "hue_": 841,
  "hue_haiñ_": 842,
  "hujū": 843,
  "hul": 844,
  "hun": 845,
  "hunar_": 846,
  "hunū": 847,
  "hus": 848,
  "husn_": 849,
  "husne": 850,
  "huu": 851,
  "huul_": 852,
  "huuñ_": 853,
  "huuñ_ki_": 854,
  "huuñ_maiñ_": 855,
  "huā": 856,
  "huā_": 857,
  "huā_hai_": 858,
  "huī_": 859,
  "huī_hai_": 860,
  "hā": 861,
  "hā_": 862,
  "hāe": 863,
  "hāle": 864,
  "hās": 865,
  "hāsil_": 866,
  "hāt": 867,
  "hāthoñ_": 868,
  "hāñ_": 869,
  "hī": 870,
  "hī_": 871,
  "hī_k": 872,
  "hī_kuchh_": 873,
  "hī_na_": 874,
  "hī_nahīñ_": 875,
  "hī_sahī_": 876,
  "hī_se_": 877,
  "hīñ": 878,
  "hīñ_": 879,
  "hū": 880,
  "hū_": 881,
  "i": 882,
  "i_": 883,
  "ib": 884,
  "id_": 885,
  "idhar_": 886,
  "ie": 887,
  "ii": 888,
  "iiñ_": 889,
  "ij": 890,
  "ije_": 891,
  "ik": 892,
  "ik_": 893,
  "il": 894,
  "il_": 895,
  "ile": 896,
  "ilti": 897,
  "ilā": 898,
  "ilā_": 899,
  "im": 900,
  "imti": 901,
  "in": 902,
  "in_": 903,
  "insā": 904,
  "inti": 905,
  "intizār_": 906,
  "iq": 907,
  "ir": 908,
  "ir_": 909,
  "ire": 910,
  "irā": 911,
  "is": 912,
  "is_": 913,
  "is_meñ_": 914,
  "is_qadar_": 915,
  "is_tarah_": 916,
  "ish": 917,
  "ish_": 918,
  "ishe": 919,
  "ishq": 920,
  "ishq_": 921,
  "ishq_ke_": 922,
  "ishq_ko_": 923,
  "ishq_kā_": 924,
  "ishq_kī_": 925,
  "ishq_meñ_": 926,
  "ishqe": 927,
  "isī_": 928,
  "it": 929,
  "itne_": 930,
  "itnā_": 931,
  "itnī_": 932,
  "iy": 933,
  "iye_": 934,
  "iyegā_": 935,
  "iyā": 936,
  "iyāñ_": 937,
  "iz": 938,
  "iz_": 939,
  "iztirā": 940,
  "iḳh": 941,
  "iḳhti": 942,
  "iḳhtiyār_": 943,
  "j": 944,
  "j_": 945,
  "ja": 946,
  "jaa": 947,
  "jaae": 948,
  "jaae_": 949,
  "jaae_hai_": 950,
  "jaaeñ_": 951,
  "jaan_": 952,
  "jaane": 953,
  "jaane_": 954,
  "jaane_k": 955,
  "jaanā_": 956,
  "jaao_": 957,
  "jaate_": 958,
  "jaate_haiñ_": 959,
  "jaatā_": 960,
  "jaatā_hai_": 961,
  "jaatī_": 962,
  "jaatī_hai_": 963,
  "jaañ_": 964,
  "jab": 965,
  "jab_": 966,
  "jab_tak_": 967,
  "jafā": 968,
  "jafā_": 969,
  "jagah_": 970,
  "jahā": 971,
  "jahāñ": 972,
  "jahāñ_": 973,
  "jahāñ_meñ_": 974,
  "jai": 975,
  "jaise_": 976,
  "jal": 977,
  "jal_": 978,
  "jalva": 979,
  "jalva_": 980,
  "jalvae": 981,
  "jalā": 982,
  "jalā_": 983,
  "jamā": 984,
  "jan": 985,
  "jau": 986,
  "javā": 987,
  "javāb_": 988,
  "jaz": 989,
  "jañ": 990,
  "je": 991,
  "jh": 992,
  "jh_": 993,
  "jha": 994,
  "jhu": 995,
  "jhā": 996,
  "jhū": 997,
  "ji": 998,
  "jigar": 999,
  "jigar_": 1000,
  "jii": 1001,
  "jin": 1002,
  "jin_": 1003,
  "jinheñ_": 1004,
  "jis": 1005,
  "jis_": 1006,
  "jis_ke_": 1007,
  "jis_ko_": 1008,
  "jis_kā_": 1009,
  "jis_kī_": 1010,
  "jis_ne_": 1011,
  "jis_se_": 1012,
  "jise_": 1013,
  "jit": 1014,
  "jiye_": 1015,
  "jo": 1016,
  "jo_": 1017,
  "jo_kuchh_": 1018,
  "jo_thā_": 1019,
  "joshe": 1020,
  "ju": 1021,
  "judā": 1022,
  "judā_": 1023,
  "jum": 1024,
  "jun": 1025,
  "junū": 1026,
  "junūñ": 1027,
  "junūñ_": 1028,
  "jur": 1029,
  "justu": 1030,
  "juuñ_": 1031,
  "juz_": 1032,
  "jā": 1033,
  "jā_": 1034,
  "jā_rahā_huuñ_maiñ_": 1035,
  "jāe": 1036,
  "jāegā_": 1037,
  "jāegī_": 1038,
  "jāeñge_": 1039,
  "jāiye_": 1040,
  "jālib_": 1041,
  "jāme": 1042,
  "jān": 1043,
  "jāne": 1044,
  "jāni": 1045,
  "jānte_haiñ_": 1046,
  "jānāñ_": 1047,
  "jāñ": 1048,
  "jāñ_": 1049,
  "jāūñ_": 1050,
  "jī_": 1051,
  "jū": 1052,
  "jū_": 1053,
  "jūd_": 1054,
  "k": 1055,
  "k_": 1056,
  "ka": 1057,
  "kal": 1058,
  "kal_": 1059,
  "kar": 1060,
  "kar_": 1061,
  "kash_": 1062,
  "kashe": 1063,
  "ke": 1064,
  "ke_": 1065,
  "kh": 1066,
  "kh_": 1067,
  "khā": 1068,
  "khā_": 1069,
  "ki": 1070,
  "ki_": 1071,
  "kin_": 1072,
  "ku": 1073,
  "kā": 1074,
  "kā_": 1075,
  "kār": 1076,
  "kār_": 1077,
  "kār_hai_": 1078,
  "kī": 1079,
  "kī_": 1080,
  "kū": 1081,
  "l": 1082,
  "l_": 1083,
  "l_hai_": 1084,
  "l_kar_": 1085,
  "l_ke_": 1086,
  "l_kā_": 1087,
  "l_kī_": 1088,
  "l_meñ_": 1089,
  "l_se_": 1090,
  "la": 1091,
  "la_": 1092,
  "laa": 1093,
  "laakh_": 1094,
  "lab": 1095,
  "lab_": 1096,
  "labe": 1097,
  "lae": 1098,
  "laf": 1099,
  "lag": 1100,
  "lag_": 1101,
  "lage_": 1102,
  "lagtā_": 1103,
  "lagtā_hai_": 1104,
  "lagā": 1105,
  "lagā_": 1106,
  "lagī_": 1107,
  "lah": 1108,
  "lahū_": 1109,
  "lak": 1110,
  "lak_": 1111,
  "lam": 1112,
  "lam_": 1113,
  "lat": 1114,
  "lat_": 1115,
  "late": 1116,
  "lau": 1117,
  "laz": 1118,
  "lazza": 1119,
  "lazzate": 1120,
  "laḍ": 1121,
  "le": 1122,
  "le_": 1123,
  "le_haiñ_": 1124,
  "le_k": 1125,
  "le_ke_": 1126,
  "legā_": 1127,
  "lekin_": 1128,
  "lenā_": 1129,
  "lete_haiñ_": 1130,
  "leñ_": 1131,
  "li": 1132,
  "lib_": 1133,
  "lik": 1134,
  "likh": 1135,
  "liy": 1136,
  "liye_": 1137,
  "liyā_": 1138,
  "liyāñ_": 1139,
  "lo": 1140,
  "lo_": 1141,
  "log": 1142,
  "log_": 1143,
  "lu": 1144,
  "luc": 1145,
  "luck": 1146,
  "luckno": 1147,
  "lucknow": 1148,
  "lut": 1149,
  "lutf_": 1150,
  "luuñ_": 1151,
  "lā": 1152,
  "lā_": 1153,
  "lāk": 1154,
  "lī": 1155,
  "lī_": 1156,
  "lī_hai_": 1157,
  "lū": 1158,
  "lūm_": 1159,
  "m": 1160,
  "m_": 1161,
  "m_hai_": 1162,
  "m_kar_": 1163,
  "m_ke_": 1164,
  "m_ko_": 1165,
  "m_kā_": 1166,
  "m_kī_": 1167,
  "m_meñ_": 1168,
  "m_se_": 1169,
  "ma": 1170,
  "ma_": 1171,
  "maa": 1172,
  "maalūm_": 1173,
  "maan_": 1174,
  "maar": 1175,
  "mad": 1176,
  "mae": 1177,
  "magar": 1178,
  "magar_": 1179,
  "mah": 1180,
  "mahf": 1181,
  "mahfil_": 1182,
  "mahsha": 1183,
  "mai": 1184,
  "mai_": 1185,
  "maika": 1186,
  "maiñ_": 1187,
  "maiñ_bhī_": 1188,
  "maiñ_huuñ_": 1189,
  "maiñ_k": 1190,
  "maiñ_ne_": 1191,
  "maiñ_to_": 1192,
  "maiḳhā": 1193,
  "maj": 1194,
  "majn": 1195,
  "majnūñ_": 1196,
  "mak": 1197,
  "mak_": 1198,
  "makā": 1199,
  "makāñ_": 1200,
  "malā": 1201,
  "man": 1202,
  "man_": 1203,
  "mane": 1204,
  "manz": 1205,
  "manzar_": 1206,
  "manzil": 1207,
  "manzil_": 1208,
  "manzile": 1209,
  "maq": 1210,
  "maqā": 1211,
  "mar": 1212,
  "mar_": 1213,
  "mas": 1214,
  "mash": 1215,
  "masī": 1216,
  "mat": 1217,
  "mat_": 1218,
  "mate": 1219,
  "matlab_": 1220,
  "mau": 1221,
  "mauje": 1222,
  "mausam_": 1223,
  "maut": 1224,
  "maut_": 1225,
  "maz": 1226,
  "mazā_": 1227,
  "maā": 1228,
  "me": 1229,
  "me_": 1230,
  "meh": 1231,
  "mehr": 1232,
  "mere_": 1233,
  "merā": 1234,
  "merā_": 1235,
  "merī_": 1236,
  "meñ": 1237,
  "meñ<eos>": 1238,
  "meñ_": 1239,
  "meñ_bhī_": 1240,
  "meñ_hai_": 1241,
  "meñ_jo_": 1242,
  "meñ_k": 1243,
  "meñ_ki_": 1244,
  "meñ_koī_": 1245,
  "meñ_kuchh_": 1246,
  "meñ_kyā_": 1247,
  "meñ_vo_": 1248,
  "meñ_ye_": 1249,
  "mi": 1250,
  "mil": 1251,
  "mil_": 1252,
  "mile_": 1253,
  "milā": 1254,
  "milā_": 1255,
  "min": 1256,
  "mir": 1257,
  "mire_": 1258,
  "mirā_": 1259,
  "mirī_": 1260,
  "misle": 1261,
  "misā": 1262,
  "mit": 1263,
  "mit_": 1264,
  "miyā": 1265,
  "miyāñ_": 1266,
  "miz": 1267,
  "mizh": 1268,
  "mizā": 1269,
  "mizāj_": 1270,
  "mo": 1271,
  "moh": 1272,
  "mohab": 1273,
  "mohabba": 1274,
  "mohabbat": 1275,
  "mohabbat_": 1276,
  "mohabbat_meñ_": 1277,
  "mohsin_": 1278,
  "mu": 1279,
  "mudda": 1280,
  "muf": 1281,
  "muj": 1282,
  "mujh": 1283,
  "mujh_": 1284,
  "mujh_ko_": 1285,
  "mujh_se_": 1286,
  "mujhe_": 1287,
  "mujhe_k": 1288,
  "mujhe_maalūm_": 1289,
  "mujhe_maalūm_na_thā_": 1290,
  "mum": 1291,
  "mumkin_": 1292,
  "mun": 1293,
  "muqad": 1294,
  "mur": 1295,
  "murā": 1296,
  "mus": 1297,
  "musal": 1298,
  "mush": 1299,
  "mushk": 1300,
  "mushkil_": 1301,
  "musku": 1302,
  "muskurā": 1303,
  "musā": 1304,
  "musī": 1305,
  "mut": 1306,
  "muñ": 1307,
  "muñh_": 1308,
  "myā": 1309,
  "mā": 1310,
  "mā_": 1311,
  "mān_": 1312,
  "māne": 1313,
  "māni": 1314,
  "mār": 1315,
  "mār_": 1316,
  "māñ": 1317,
  "māñ_": 1318,
  "māñge_": 1319,
  "mī": 1320,
  "mī_": 1321,
  "mīr_": 1322,
  "mū": 1323,
  "n": 1324,
  "n_": 1325,
  "n_hai_": 1326,
  "n_ke_": 1327,
  "n_ko_": 1328,
  "n_kā_": 1329,
  "n_kī_": 1330,
  "n_meñ_": 1331,
  "n_se_": 1332,
  "n_se_niklā_": 1333,
  "na": 1334,
  "na_": 1335,
  "na_dekhā_": 1336,
  "na_ham_": 1337,
  "na_ho": 1338,
  "na_ho_": 1339,
  "na_huā_": 1340,
  "na_jaae_": 1341,
  "na_kah": 1342,
  "na_kar_": 1343,
  "na_koī_": 1344,
  "na_pūchh_": 1345,
  "na_rahe_": 1346,
  "na_rahā_": 1347,
  "na_thā_": 1348,
  "na_thī_": 1349,
  "na_vo_": 1350,
  "naa": 1351,
  "naam_": 1352,
  "naaz_": 1353,
  "nae": 1354,
  "nae_": 1355,
  "naf": 1356,
  "nafas_": 1357,
  "nah": 1358,
  "nahīñ": 1359,
  "nahīñ<eos>": 1360,
  "nahīñ_": 1361,
  "nahīñ_aa": 1362,
  "nahīñ_aatā_": 1363,
  "nahīñ_de": 1364,
  "nahīñ_hai_": 1365,
  "nahīñ_haiñ_": 1366,
  "nahīñ_ho": 1367,
  "nahīñ_hotā_": 1368,
  "nahīñ_k": 1369,
  "nahīñ_kar": 1370,
  "nahīñ_ki_": 1371,
  "nahīñ_mil": 1372,
  "nahīñ_miltā_": 1373,
  "nahīñ_rahā_": 1374,
  "nahīñ_sak": 1375,
  "nahīñ_saktā_": 1376,
  "nam": 1377,
  "nam_": 1378,
  "naq": 1379,
  "naqshe": 1380,
  "nar": 1381,
  "nash": 1382,
  "nashā": 1383,
  "nasī": 1384,
  "nasīb_": 1385,
  "nat_": 1386,
  "nate": 1387,
  "nau": 1388,
  "navā": 1389,
  "nayā_": 1390,
  "naz": 1391,
  "nazar": 1392,
  "nazar_": 1393,
  "nazar_aayā_": 1394,
  "nazar_meñ_": 1395,
  "naġh": 1396,
  "naī_": 1397,
  "nd": 1398,
  "nd_": 1399,
  "ne": 1400,
  "ne_": 1401,
  "ne_k": 1402,
  "ne_ke_": 1403,
  "ne_ke_liye_": 1404,
  "ne_ko_": 1405,
  "ne_kā_": 1406,
  "ne_kī_": 1407,
  "ne_lag": 1408,
  "ne_lage_": 1409,
  "ne_meñ_": 1410,
  "ne_se_": 1411,
  "ne_vaa": 1412,
  "ne_vaale_": 1413,
  "ne_vaalā_": 1414,
  "ni": 1415,
  "nigah": 1416,
  "nigah_": 1417,
  "nigahe": 1418,
  "nigā": 1419,
  "nigāh_": 1420,
  "nigāhe": 1421,
  "nihā": 1422,
  "nihāñ_": 1423,
  "nii": 1424,
  "niiñ": 1425,
  "nik": 1426,
  "nikal": 1427,
  "nikal_": 1428,
  "nikaltī_hai_": 1429,
  "nikle_": 1430,
  "niklā_": 1431,
  "nikā": 1432,
  "nishā": 1433,
  "nishāñ_": 1434,
  "niyā": 1435,
  "nj": 1436,
  "njī": 1437,
  "no": 1438,
  "noñ_": 1439,
  "noñ_ko_": 1440,
  "noñ_meñ_": 1441,
  "nu": 1442,
  "num": 1443,
  "numā": 1444,
  "numā_": 1445,
  "nā": 1446,
  "nā_": 1447,
  "nā_hai_": 1448,
  "nā_ki_": 1449,
  "nāe": 1450,
  "nām_": 1451,
  "nāse": 1452,
  "nāseh_": 1453,
  "nāz": 1454,
  "nāz_": 1455,
  "nāzu": 1456,
  "nī": 1457,
  "nī_": 1458,
  "nī_bhī_": 1459,
  "nī_hai_": 1460,
  "nī_huī_": 1461,
  "nī_k": 1462,
  "nī_kī_": 1463,
  "nīe": 1464,
  "nū": 1465,
  "o": 1466,
  "o_": 1467,
  "oge_": 1468,
  "oñ": 1469,
  "oñ_": 1470,
  "oñ_ke_": 1471,
  "oñ_ko_": 1472,
  "oñ_kā_": 1473,
  "oñ_kī_": 1474,
  "oñ_kī_tarah_": 1475,
  "oñ_meñ_": 1476,
  "oñ_ne_": 1477,
  "oñ_par_": 1478,
  "oñ_pe_": 1479,
  "oñ_se_": 1480,
  "oī_": 1481,
  "p": 1482,
  "p_": 1483,
  "pa": 1484,
  "paa": 1485,
  "paanī_": 1486,
  "paas_": 1487,
  "paayā_": 1488,
  "paañv_": 1489,
  "pah": 1490,
  "pahchā": 1491,
  "pahl": 1492,
  "pahle_": 1493,
  "pahlū_": 1494,
  "pahuñ": 1495,
  "pahuñche_": 1496,
  "pahuñchā_": 1497,
  "pai": 1498,
  "paidā": 1499,
  "paidā_": 1500,
  "paimā": 1501,
  "paira": 1502,
  "pal": 1503,
  "par": 1504,
  "par_": 1505,
  "para": 1506,
  "parda_": 1507,
  "pare": 1508,
  "pareshā": 1509,
  "pareshāñ_": 1510,
  "parvā": 1511,
  "parī": 1512,
  "pat": 1513,
  "patt": 1514,
  "patthar_": 1515,
  "payā": 1516,
  "paḍ": 1517,
  "paḍe_": 1518,
  "paḍā_": 1519,
  "pe": 1520,
  "pe_": 1521,
  "pe_k": 1522,
  "pesh_": 1523,
  "ph": 1524,
  "phai": 1525,
  "phe": 1526,
  "phir": 1527,
  "phir_": 1528,
  "phir_bhī_": 1529,
  "phirī_": 1530,
  "phu": 1531,
  "phuul": 1532,
  "phuul_": 1533,
  "phū": 1534,
  "pi": 1535,
  "pii": 1536,
  "pin": 1537,
  "pinhāñ_": 1538,
  "pu": 1539,
  "pur": 1540,
  "purā": 1541,
  "pyaar": 1542,
  "pyaar_": 1543,
  "pyā": 1544,
  "pyāre_": 1545,
  "pā": 1546,
  "pā_": 1547,
  "pāe": 1548,
  "pāñ": 1549,
  "pī": 1550,
  "pī_": 1551,
  "pū": 1552,
  "pūch": 1553,
  "pūchh": 1554,
  "pūchh_": 1555,
  "q": 1556,
  "q_": 1557,
  "q_kī_": 1558,
  "qa": 1559,
  "qa_": 1560,
  "qab": 1561,
  "qad": 1562,
  "qadam_": 1563,
  "qadar_": 1564,
  "qafas_": 1565,
  "qai": 1566,
  "qar": 1567,
  "qarār_": 1568,
  "qarī": 1569,
  "qarīb_": 1570,
  "qasam_": 1571,
  "qat": 1572,
  "qat_": 1573,
  "qate": 1574,
  "qatra_": 1575,
  "qayā": 1576,
  "qayāmat": 1577,
  "qayāmat_": 1578,
  "qe": 1579,
  "qi": 1580,
  "qis": 1581,
  "qismat_": 1582,
  "qu": 1583,
  "qur": 1584,
  "qā": 1585,
  "qāb": 1586,
  "qābil_": 1587,
  "qāfil": 1588,
  "qāt": 1589,
  "qātil": 1590,
  "qātil_": 1591,
  "qī": 1592,
  "qī_": 1593,
  "qī_hai_": 1594,
  "r": 1595,
  "r_": 1596,
  "r_hai_": 1597,
  "r_ke_": 1598,
  "r_ko_": 1599,
  "r_kā_": 1600,
  "r_kī_": 1601,
  "r_meñ_": 1602,
  "r_o_": 1603,
  "r_se_": 1604,
  "ra": 1605,
  "ra_": 1606,
  "raa": 1607,
  "raah_": 1608,
  "raat_": 1609,
  "raaz_": 1610,
  "rab": 1611,
  "rab_": 1612,
  "rae": 1613,
  "raf": 1614,
  "rafta_": 1615,
  "rage": 1616,
  "rah": 1617,
  "rah_": 1618,
  "rah_gayā_": 1619,
  "rah_gaī_": 1620,
  "rahe": 1621,
  "rahe_": 1622,
  "rahe_haiñ_": 1623,
  "rahā": 1624,
  "rahā_": 1625,
  "rahā_hai_": 1626,
  "rahā_huuñ_": 1627,
  "rahā_huuñ_maiñ_": 1628,
  "rahī_": 1629,
  "rahī_hai_": 1630,
  "rak": 1631,
  "rakh": 1632,
  "rakh_": 1633,
  "rakhte_haiñ_": 1634,
  "rakkh": 1635,
  "ram_": 1636,
  "ran": 1637,
  "raqī": 1638,
  "raqīb_": 1639,
  "ras": 1640,
  "rash": 1641,
  "rasta_": 1642,
  "raste_": 1643,
  "rat": 1644,
  "rat_": 1645,
  "rate": 1646,
  "rau": 1647,
  "raush": 1648,
  "raushan_": 1649,
  "raushnī_": 1650,
  "rav": 1651,
  "ravā": 1652,
  "rañ": 1653,
  "rañg": 1654,
  "rañg_": 1655,
  "rañge": 1656,
  "re": 1657,
  "re_": 1658,
  "re_k": 1659,
  "reñ_": 1660,
  "ri": 1661,
  "rin": 1662,
  "rish": 1663,
  "ro": 1664,
  "ro_": 1665,
  "roz": 1666,
  "roz_": 1667,
  "ru": 1668,
  "rus": 1669,
  "rusvā": 1670,
  "ruu": 1671,
  "ruuh_": 1672,
  "ruḳh": 1673,
  "ruḳh_": 1674,
  "ruḳhsa": 1675,
  "rā": 1676,
  "rā_": 1677,
  "rāb_": 1678,
  "rāh": 1679,
  "rāh_": 1680,
  "rāhe": 1681,
  "rār_": 1682,
  "rāteñ_": 1683,
  "rāz": 1684,
  "rāze": 1685,
  "rāñ_": 1686,
  "rī": 1687,
  "rī_": 1688,
  "rī_hai_": 1689,
  "rū": 1690,
  "rū_": 1691,
  "rūe": 1692,
  "rūr_": 1693,
  "s": 1694,
  "s_": 1695,
  "sa": 1696,
  "sa_": 1697,
  "saa": 1698,
  "saae_": 1699,
  "saaf_": 1700,
  "saaqī_": 1701,
  "saar": 1702,
  "saare_": 1703,
  "saarī_": 1704,
  "saath_": 1705,
  "saañ": 1706,
  "saañs_": 1707,
  "sab": 1708,
  "sab_": 1709,
  "sab_kuchh_": 1710,
  "sabab_": 1711,
  "sabā_": 1712,
  "sach": 1713,
  "sach_": 1714,
  "sad": 1715,
  "sadā": 1716,
  "sadā_": 1717,
  "sae": 1718,
  "saf": 1719,
  "safar": 1720,
  "safar_": 1721,
  "sah": 1722,
  "sahar_": 1723,
  "sahrā": 1724,
  "sahrā_": 1725,
  "sahī_": 1726,
  "saj": 1727,
  "sak": 1728,
  "sake_": 1729,
  "sakā_": 1730,
  "sal": 1731,
  "salā": 1732,
  "salāmat_": 1733,
  "salī": 1734,
  "sam": 1735,
  "sam_": 1736,
  "sama": 1737,
  "samajh": 1738,
  "samajh_": 1739,
  "samajhte_haiñ_": 1740,
  "sambhā": 1741,
  "samjh": 1742,
  "samjhe_": 1743,
  "samjhā_": 1744,
  "samun": 1745,
  "samundar_": 1746,
  "samā": 1747,
  "san": 1748,
  "sanam_": 1749,
  "sar": 1750,
  "sar_": 1751,
  "sare": 1752,
  "sarā": 1753,
  "sarāpā_": 1754,
  "satā": 1755,
  "sau": 1756,
  "sau_": 1757,
  "savv": 1758,
  "savā": 1759,
  "sayyā": 1760,
  "sazā_": 1761,
  "sañ": 1762,
  "sañg": 1763,
  "saḳh": 1764,
  "saḳht_": 1765,
  "se": 1766,
  "se<eos>": 1767,
  "se_": 1768,
  "se_bhī_": 1769,
  "se_hai_": 1770,
  "se_ham_": 1771,
  "se_ho_": 1772,
  "se_k": 1773,
  "se_kah": 1774,
  "se_ki_": 1775,
  "se_koī_": 1776,
  "se_kuchh_": 1777,
  "se_kyā_": 1778,
  "se_mil": 1779,
  "se_pahle_": 1780,
  "se_vo_": 1781,
  "sh": 1782,
  "sh_": 1783,
  "sha": 1784,
  "sha_": 1785,
  "shaam_": 1786,
  "shab": 1787,
  "shab_": 1788,
  "shabe": 1789,
  "shae": 1790,
  "shah": 1791,
  "shahr_": 1792,
  "shahr_meñ_": 1793,
  "shahre": 1794,
  "shahī": 1795,
  "shai": 1796,
  "shaiḳh_": 1797,
  "shak": 1798,
  "sham": 1799,
  "shama_": 1800,
  "shame": 1801,
  "shan_": 1802,
  "shar": 1803,
  "sharā": 1804,
  "sharāb_": 1805,
  "shau": 1806,
  "shauq": 1807,
  "shauq_": 1808,
  "shauqe": 1809,
  "shaḳh": 1810,
  "shaḳhs_": 1811,
  "she": 1812,
  "shi": 1813,
  "shik": 1814,
  "shika": 1815,
  "shikva": 1816,
  "shikā": 1817,
  "shikāya": 1818,
  "shk": 1819,
  "sho": 1820,
  "shoa": 1821,
  "shor_": 1822,
  "shoḳh": 1823,
  "shoḳh_": 1824,
  "shu": 1825,
  "shuk": 1826,
  "shā": 1827,
  "shā_": 1828,
  "shāme": 1829,
  "shāya": 1830,
  "shāyad_": 1831,
  "shāñ_": 1832,
  "shāḳh_": 1833,
  "shāḳhe": 1834,
  "shī": 1835,
  "shī_": 1836,
  "shīr": 1837,
  "si": 1838,
  "sii": 1839,
  "siine_meñ_": 1840,
  "sil": 1841,
  "sin_": 1842,
  "sir": 1843,
  "sirf_": 1844,
  "sita": 1845,
  "sitam": 1846,
  "sitam_": 1847,
  "sitār": 1848,
  "sivā": 1849,
  "sivā_": 1850,
  "siyā": 1851,
  "sla_": 1852,
  "sle": 1853,
  "so": 1854,
  "so_": 1855,
  "soch": 1856,
  "soh": 1857,
  "soze": 1858,
  "st": 1859,
  "st_": 1860,
  "sta": 1861,
  "sta_": 1862,
  "ste": 1863,
  "ste_": 1864,
  "stā": 1865,
  "stāñ_": 1866,
  "su": 1867,
  "sub": 1868,
  "subh": 1869,
  "subh_": 1870,
  "subhe": 1871,
  "sukū": 1872,
  "sun": 1873,
  "sun_": 1874,
  "sunā": 1875,
  "sunā_": 1876,
  "sunā_hai_": 1877,
  "sur": 1878,
  "suu": 1879,
  "suuñ_": 1880,
  "suḳha": 1881,
  "suḳhan_": 1882,
  "sā": 1883,
  "sā_": 1884,
  "sāh": 1885,
  "sāhil_": 1886,
  "sām": 1887,
  "sāmne_": 1888,
  "sār": 1889,
  "sār_": 1890,
  "sāze": 1891,
  "sāñ_": 1892,
  "sāġ": 1893,
  "sī": 1894,
  "sī_": 1895,
  "sī_hai_": 1896,
  "sī_k": 1897,
  "sū": 1898,
  "sū_": 1899,
  "sūe": 1900,
  "sūra": 1901,
  "sūraj_": 1902,
  "sūrat_": 1903,
  "sūrate": 1904,
  "t": 1905,
  "t_": 1906,
  "t_hai_": 1907,
  "t_ke_": 1908,
  "t_ko_": 1909,
  "t_kā_": 1910,
  "t_kī_": 1911,
  "t_meñ_": 1912,
  "t_se_": 1913,
  "ta": 1914,
  "ta_": 1915,
  "taa": 1916,
  "taal": 1917,
  "taallu": 1918,
  "tab": 1919,
  "tab_": 1920,
  "tabī": 1921,
  "tabīa": 1922,
  "tabīat_": 1923,
  "tae": 1924,
  "tah": 1925,
  "tak": 1926,
  "tak_": 1927,
  "takal": 1928,
  "takallu": 1929,
  "tal": 1930,
  "talab": 1931,
  "talab_": 1932,
  "talak_": 1933,
  "talā": 1934,
  "talāsh": 1935,
  "tam": 1936,
  "taman": 1937,
  "tamannā": 1938,
  "tamannā_": 1939,
  "tamā": 1940,
  "tamām_": 1941,
  "tamāshā": 1942,
  "tamāshā_": 1943,
  "tan": 1944,
  "tan_": 1945,
  "tanhā": 1946,
  "tanhā_": 1947,
  "tap": 1948,
  "taq": 1949,
  "taqdī": 1950,
  "taqā": 1951,
  "tar": 1952,
  "tar_": 1953,
  "tara": 1954,
  "taraf_": 1955,
  "tarah": 1956,
  "tarah_": 1957,
  "tarke": 1958,
  "tarze": 1959,
  "tas": 1960,
  "tasavv": 1961,
  "tasvī": 1962,
  "tau": 1963,
  "tavā": 1964,
  "taz": 1965,
  "tañg_": 1966,
  "taġhā": 1967,
  "taġhāfu": 1968,
  "taḍ": 1969,
  "te": 1970,
  "te_": 1971,
  "te_hai": 1972,
  "te_haiñ<eos>": 1973,
  "te_haiñ_": 1974,
  "te_haiñ_ham_": 1975,
  "te_haiñ_k": 1976,
  "te_haiñ_ki_": 1977,
  "te_ho_": 1978,
  "te_hue_": 1979,
  "te_hī_": 1980,
  "te_rah": 1981,
  "te_the_": 1982,
  "tere_": 1983,
  "terā_": 1984,
  "terī_": 1985,
  "tez_": 1986,
  "teñ_": 1987,
  "teġhe": 1988,
  "th": 1989,
  "th_": 1990,
  "tha": 1991,
  "thah": 1992,
  "the_": 1993,
  "the_ham_": 1994,
  "thi": 1995,
  "thiiñ_": 1996,
  "thikā": 1997,
  "tho": 1998,
  "thā": 1999,
  "thā<eos>": 2000,
  "thā_": 2001,
  "thā_ki_": 2002,
  "thā_vo_": 2003,
  "thī_": 2004,
  "thī_k": 2005,
  "ti": 2006,
  "tiir_": 2007,
  "tir": 2008,
  "tire_": 2009,
  "tirā": 2010,
  "tirā_": 2011,
  "tirī_": 2012,
  "tish": 2013,
  "tishna": 2014,
  "tiyā": 2015,
  "to": 2016,
  "to_": 2017,
  "to_de_": 2018,
  "to_hai_": 2019,
  "to_ho_": 2020,
  "to_koī_": 2021,
  "to_kuchh_": 2022,
  "to_kyā_": 2023,
  "to_nahīñ_": 2024,
  "to_phir_": 2025,
  "to_sak": 2026,
  "to_saktī_hai_": 2027,
  "to_ye_": 2028,
  "toḍ_": 2029,
  "tu": 2030,
  "tujh": 2031,
  "tujh_": 2032,
  "tujh_ko_": 2033,
  "tujh_se_": 2034,
  "tujhe_": 2035,
  "tum": 2036,
  "tum_": 2037,
  "tum_ko_": 2038,
  "tum_ne_": 2039,
  "tumheñ_": 2040,
  "tumhā": 2041,
  "tumhāre_": 2042,
  "tumhārā_": 2043,
  "tumhārī_": 2044,
  "tur": 2045,
  "tuu": 2046,
  "tā": 2047,
  "tā<eos>": 2048,
  "tā_": 2049,
  "tā_hai": 2050,
  "tā_hai_": 2051,
  "tā_huuñ_": 2052,
  "tā_huuñ_maiñ_": 2053,
  "tā_nahīñ_": 2054,
  "tā_thā_": 2055,
  "tāb": 2056,
  "tāb_": 2057,
  "tābe": 2058,
  "tāe": 2059,
  "tār": 2060,
  "tār_": 2061,
  "tāre": 2062,
  "tārī": 2063,
  "tī": 2064,
  "tī_": 2065,
  "tī_hai_": 2066,
  "tī_haiñ_": 2067,
  "tī_huī_": 2068,
  "tū": 2069,
  "tū_": 2070,
  "tū_ne_": 2071,
  "u": 2072,
  "uchh": 2073,
  "uchh_": 2074,
  "udaa": 2075,
  "udaas_": 2076,
  "udhar_": 2077,
  "uf": 2078,
  "uf_": 2079,
  "ujā": 2080,
  "ul": 2081,
  "ulfa": 2082,
  "ulfat_": 2083,
  "ultī_": 2084,
  "um": 2085,
  "ummī": 2086,
  "ummīd_": 2087,
  "umr_": 2088,
  "umī": 2089,
  "un": 2090,
  "un_": 2091,
  "un_ke_": 2092,
  "un_ko_": 2093,
  "un_kā_": 2094,
  "un_kī_": 2095,
  "un_se_": 2096,
  "unheñ_": 2097,
  "uq": 2098,
  "ur": 2099,
  "ur_": 2100,
  "us": 2101,
  "us_": 2102,
  "us_ke_": 2103,
  "us_ko_": 2104,
  "us_kā_": 2105,
  "us_kī_": 2106,
  "us_ne_": 2107,
  "us_se_": 2108,
  "use_": 2109,
  "ush": 2110,
  "ustu": 2111,
  "usī_": 2112,
  "ut": 2113,
  "ut_": 2114,
  "utar": 2115,
  "utar_": 2116,
  "uth": 2117,
  "uth_": 2118,
  "uthā": 2119,
  "uthā_": 2120,
  "uu": 2121,
  "uuñ_": 2122,
  "uz": 2123,
  "uñ": 2124,
  "uñ_": 2125,
  "uḍ": 2126,
  "v": 2127,
  "v_": 2128,
  "va": 2129,
  "vaa": 2130,
  "vaaiz_": 2131,
  "vaale_": 2132,
  "vaañ_": 2133,
  "vafā": 2134,
  "vafā_": 2135,
  "vah": 2136,
  "vahsha": 2137,
  "vahshat_": 2138,
  "vahāñ_": 2139,
  "vahī_": 2140,
  "vaj": 2141,
  "valī_": 2142,
  "vaq": 2143,
  "vaqt_": 2144,
  "vaqte": 2145,
  "var": 2146,
  "var_": 2147,
  "varna_": 2148,
  "vas": 2149,
  "vasl_": 2150,
  "vasī": 2151,
  "vat_": 2152,
  "ve": 2153,
  "ve_": 2154,
  "vi": 2155,
  "visā": 2156,
  "visāl_": 2157,
  "vo": 2158,
  "vo_": 2159,
  "vo_bhī_": 2160,
  "vo_jo_": 2161,
  "vv": 2162,
  "vva": 2163,
  "vā": 2164,
  "vā_": 2165,
  "vāl": 2166,
  "vār": 2167,
  "vār_": 2168,
  "vāste_": 2169,
  "vāñ_": 2170,
  "vī": 2171,
  "vīrā": 2172,
  "w": 2173,
  "x": 2174,
  "y": 2175,
  "ya": 2176,
  "ya_": 2177,
  "yaa": 2178,
  "yaad": 2179,
  "yaad_": 2180,
  "yaad_aa": 2181,
  "yaad_aayā_": 2182,
  "yaanī_": 2183,
  "yaar": 2184,
  "yaar_": 2185,
  "yaaro_": 2186,
  "yaañ_": 2187,
  "yae": 2188,
  "yah": 2189,
  "yahāñ_": 2190,
  "yahī_": 2191,
  "yak": 2192,
  "yak_": 2193,
  "yat_": 2194,
  "ye": 2195,
  "ye_": 2196,
  "ye_bhī_": 2197,
  "ye_k": 2198,
  "ye_kah": 2199,
  "ye_kyā_": 2200,
  "yuu": 2201,
  "yuuñ_": 2202,
  "yuuñ_to_": 2203,
  "yya": 2204,
  "yyā": 2205,
  "yā": 2206,
  "yā<eos>": 2207,
  "yā_": 2208,
  "yā_hai_": 2209,
  "yā_ki_": 2210,
  "yā_kyā_": 2211,
  "yā_na_": 2212,
  "yā_rab_": 2213,
  "yād": 2214,
  "yār": 2215,
  "yār_": 2216,
  "yāñ_": 2217,
  "yū": 2218,
  "yūsu": 2219,
  "yūñ": 2220,
  "yūñhī_": 2221,
  "yūñkar_": 2222,
  "z": 2223,
  "z_": 2224,
  "z_hai_": 2225,
  "z_kī_": 2226,
  "z_se_": 2227,
  "za": 2228,
  "za_": 2229,
  "zab": 2230,
  "zabā": 2231,
  "zabāñ_": 2232,
  "zae": 2233,
  "zafar_": 2234,
  "zah": 2235,
  "zahr_": 2236,
  "zam": 2237,
  "zamā": 2238,
  "zamāna_": 2239,
  "zamāne_meñ_": 2240,
  "zamī": 2241,
  "zamīñ_": 2242,
  "zanjī": 2243,
  "zar": 2244,
  "zarra_": 2245,
  "zarā_": 2246,
  "zarū": 2247,
  "zat_": 2248,
  "zau": 2249,
  "zauqe": 2250,
  "zaḳh": 2251,
  "zaḳhm_": 2252,
  "zaḳhme": 2253,
  "ze": 2254,
  "zeh": 2255,
  "zere": 2256,
  "zi": 2257,
  "zik": 2258,
  "zikr_": 2259,
  "zin": 2260,
  "zinda": 2261,
  "zinda_": 2262,
  "zindag": 2263,
  "zindagī_": 2264,
  "zindāñ_": 2265,
  "ziyā": 2266,
  "ziyāda_": 2267,
  "zo": 2268,
  "zu": 2269,
  "zul": 2270,
  "zulf": 2271,
  "zulf_": 2272,
  "zulfe": 2273,
  "zā": 2274,
  "zā_": 2275,
  "zāhi": 2276,
  "zāhid_": 2277,
  "zāhir_": 2278,
  "zāli": 2279,
  "zālim_": 2280,
  "zār": 2281,
  "zār_": 2282,
  "zāñ_": 2283,
  "zī": 2284,
  "zī_": 2285,
  "zū": 2286,
  "zū_": 2287,
  "ñ": 2288,
  "ñ<eos>": 2289,
  "ñ_": 2290,
  "ñ_k": 2291,
  "ñ_kah": 2292,
  "ñ_kahāñ_": 2293,
  "ñ_kar": 2294,
  "ñ_ke_": 2295,
  "ñ_ki_": 2296,
  "ñ_kis_": 2297,
  "ñ_ko": 2298,
  "ñ_ko_": 2299,
  "ñ_koī_": 2300,
  "ñ_kuchh_": 2301,
  "ñ_kyuuñ_": 2302,
  "ñ_kyā_": 2303,
  "ñ_kā": 2304,
  "ñ_kā_": 2305,
  "ñ_kī_": 2306,
  "ñd": 2307,
  "ñg": 2308,
  "ñg_": 2309,
  "ñge": 2310,
  "ñge_": 2311,
  "ñgā": 2312,
  "ñgā_": 2313,
  "ñgī_": 2314,
  "ñv_": 2315,
  "ā": 2316,
  "ā_": 2317,
  "ā_hai_": 2318,
  "āb": 2319,
  "ābe": 2320,
  "āe": 2321,
  "āf": 2322,
  "āhi": 2323,
  "āhista": 2324,
  "āhista_": 2325,
  "āla": 2326,
  "ālam_": 2327,
  "ālame": 2328,
  "ār": 2329,
  "ār_": 2330,
  "āre": 2331,
  "āre_": 2332,
  "ārā": 2333,
  "ārā_": 2334,
  "ārī_": 2335,
  "ās": 2336,
  "āsh": 2337,
  "āshi": 2338,
  "āshiq": 2339,
  "āshiq_": 2340,
  "āshnā": 2341,
  "āshnā_": 2342,
  "āsmā": 2343,
  "āsmāñ_": 2344,
  "āsāñ_": 2345,
  "āt": 2346,
  "ātish": 2347,
  "ātish_": 2348,
  "ātishe": 2349,
  "āvā": 2350,
  "āvār": 2351,
  "āvāz_": 2352,
  "āz": 2353,
  "āzmā": 2354,
  "āzā": 2355,
  "āzād_": 2356,
  "āñ": 2357,
  "āñ_": 2358,
  "āñ_ke_": 2359,
  "āñ_kā_": 2360,
  "āñk": 2361,
  "āñkh": 2362,
  "āñkheñ_": 2363,
  "āñkhoñ": 2364,
  "āñkhoñ_": 2365,
  "āñkhoñ_meñ_": 2366,
  "āī": 2367,
  "āīna_": 2368,
  "āīnae": 2369,
  "āḳh": 2370,
  "āḳhir": 2371,
  "āḳhir_": 2372,
  "ē": 2373,
  "ġ": 2374,
  "ġh": 2375,
  "ġh_": 2376,
  "ġha": 2377,
  "ġhaf": 2378,
  "ġhai": 2379,
  "ġhair": 2380,
  "ġhair_": 2381,
  "ġham": 2382,
  "ġham_": 2383,
  "ġham_se_": 2384,
  "ġhame": 2385,
  "ġhara": 2386,
  "ġharaz_": 2387,
  "ġharī": 2388,
  "ġhaz": 2389,
  "ġhaza": 2390,
  "ġhe": 2391,
  "ġho": 2392,
  "ġhu": 2393,
  "ġhubāre": 2394,
  "ġhun": 2395,
  "ġhā": 2396,
  "ġhāf": 2397,
  "ġhāfil_": 2398,
  "ġhāli": 2399,
  "ġhālib": 2400,
  "ġhālib_": 2401,
  "ġhāñ_": 2402,
  "ī": 2403,
  "ī<eos>": 2404,
  "ī_": 2405,
  "ī_hai_": 2406,
  "ī_k": 2407,
  "ī_ka": 2408,
  "ī_kah": 2409,
  "ī_kar": 2410,
  "ī_ke_": 2411,
  "ī_ki_": 2412,
  "ī_ko": 2413,
  "ī_ko_": 2414,
  "ī_koī_": 2415,
  "ī_kyā_": 2416,
  "ī_kā": 2417,
  "ī_kā_": 2418,
  "ī_kī_": 2419,
  "ī_meñ_": 2420,
  "ī_na_": 2421,
  "ī_se_": 2422,
  "īe": 2423,
  "īñ": 2424,
  "īñ_": 2425,
  "īñ_k": 2426,
  "īñ_se_": 2427,
  "ū": 2428,
  "ū_": 2429,
  "ūr_": 2430,
  "ūñ": 2431,
  "ūñ_": 2432,
  "ūñg": 2433,
  "ūñgā_": 2434,
  "ḍ": 2435,
  "ḍ_": 2436,
  "ḍe_": 2437,
  "ḍā": 2438,
  "ḍā_": 2439,
  "ḍī_": 2440,
  "ḳ": 2441,
  "ḳh": 2442,
  "ḳh_": 2443,
  "ḳha": 2444,
  "ḳhaak_": 2445,
  "ḳhabar": 2446,
  "ḳhabar_": 2447,
  "ḳhafā_": 2448,
  "ḳhai": 2449,
  "ḳhair_": 2450,
  "ḳhal": 2451,
  "ḳhan": 2452,
  "ḳhanj": 2453,
  "ḳharā": 2454,
  "ḳharāb_": 2455,
  "ḳhat": 2456,
  "ḳhat_": 2457,
  "ḳhayā": 2458,
  "ḳhayāl_": 2459,
  "ḳhayāle": 2460,
  "ḳhe": 2461,
  "ḳhi": 2462,
  "ḳhirā": 2463,
  "ḳhiz": 2464,
  "ḳhizāñ_": 2465,
  "ḳhta": 2466,
  "ḳhu": 2467,
  "ḳhud": 2468,
  "ḳhud_": 2469,
  "ḳhud_ko_": 2470,
  "ḳhudā": 2471,
  "ḳhudā_": 2472,
  "ḳhudī_": 2473,
  "ḳhur": 2474,
  "ḳhurshī": 2475,
  "ḳhush": 2476,
  "ḳhush_": 2477,
  "ḳhushbū": 2478,
  "ḳhushbū_": 2479,
  "ḳhushī_": 2480,
  "ḳhuu": 2481,
  "ḳhuub_": 2482,
  "ḳhvā": 2483,
  "ḳhvāb": 2484,
  "ḳhvāb_": 2485,
  "ḳhvāhi": 2486,
  "ḳhvāhish_": 2487,
  "ḳhā": 2488,
  "ḳhāk": 2489,
  "ḳhāmo": 2490,
  "ḳhāna": 2491,
  "ḳhānae": 2492,
  "ḳhāti": 2493,
  "ḳhātir_": 2494,
  "ḳhū": 2495,
  "ḳhū_": 2496,
  "ḳhūne": 2497,
  "ḳhūñ": 2498,
  "ḳhūñ_": 2499
}