{
  "<eos>": 0,
  "<pad>": 1,
  "<sos>": 2,
  "<unk>": 3,
  "،": 4,
  "ؔ": 5,
  "؟": 6,
  "ء": 7,
  "آ": 8,
  "آؤ": 9,
  "آؤں": 10,
  "آئ": 11,
  "آئنہ": 12,
  "آئنے": 13,
  "آئی": 14,
  "آئین": 15,
  "آئینہ": 16,
  "آئینۂ": 17,
  "آئینے": 18,
  "آئیں": 19,
  "آئیے": 20,
  "آئے": 21,
  "آئے<eos>": 22,
  "آب": 23,
  "آباد": 24,
  "آبرو": 25,
  "آبلہ": 26,
  "آبگی": 27,
  "آتا": 28,
  "آتش": 29,
  "آتشیں": 30,
  "آتی": 31,
  "آتے": 32,
  "آثار": 33,
  "آج": 34,
  "آخر": 35,
  "آخری": 36,
  "آد": 37,
  "آداب": 38,
  "آدم": 39,
  "آدمی": 40,
  "آر": 41,
  "آرا": 42,
  "آرائش": 43,
  "آرائی": 44,
  "آرام": 45,
  "آرزو": 46,
  "آرزوئے": 47,
  "آرسی": 48,
  "آز": 49,
  "آزا": 50,
  "آزاد": 51,
  "آزادی": 52,
  "آزار": 53,
  "آزر": 54,
  "آزما": 55,
  "آزمائش": 56,
  "آزمانے": 57,
  "آس": 58,
  "آسا": 59,
  "آسان": 60,
  "آسانی": 61,
  "آساں": 62,
  "آست": 63,
  "آستاں": 64,
  "آستیں": 65,
  "آسمان": 66,
  "آسمانی": 67,
  "آسماں": 68,
  "آش": 69,
  "آشفتہ": 70,
  "آشنا": 71,
  "آشنائی": 72,
  "آشوب": 73,
  "آشکار": 74,
  "آشیاں": 75,
  "آغ": 76,
  "آغاز": 77,
  "آغوش": 78,
  "آف": 79,
  "آفاق": 80,
  "آفت": 81,
  "آفتاب": 82,
  "آلو": 83,
  "آلودہ": 84,
  "آما": 85,
  "آمد": 86,
  "آن": 87,
  "آنا": 88,
  "آندھی": 89,
  "آندھیوں": 90,
  "آنسو": 91,
  "آنسوؤں": 92,
  "آنچ": 93,
  "آنچل": 94,
  "آنکھ": 95,
  "آنکھوں": 96,
  "آنکھیں": 97,
  "آنگ": 98,
  "آنگن": 99,
  "آنے": 100,
  "آوار": 101,
  "آوارگی": 102,
  "آوارہ": 103,
  "آواز": 104,
  "آویں": 105,
  "آوے": 106,
  "آپ": 107,
  "آگ": 108,
  "آگہی": 109,
  "آگے": 110,
  "آں": 111,
  "آہ": 112,
  "آہستہ": 113,
  "آہو": 114,
  "آہٹ": 115,
  "آیا": 116,
  "آیا<eos>": 117,
  "أ": 118,
  "ؤ": 119,
  "ؤں": 120,
  "ئ": 121,
  "ئش": 122,
  "ئق": 123,
  "ئل": 124,
  "ئم": 125,
  "ئي": 126,
  "ئی": 127,
  "ئیاں": 128,
  "ئیں": 129,
  "ئیے": 130,
  "ئے": 131,
  "ا": 132,
  "ائے": 133,
  "اب": 134,
  "ابت": 135,
  "ابتدا": 136,
  "ابد": 137,
  "ابر": 138,
  "ابرو": 139,
  "ابل": 140,
  "ابھ": 141,
  "ابھر": 142,
  "ابھی": 143,
  "ات": 144,
  "اتار": 145,
  "اتر": 146,
  "اترا": 147,
  "اترتا": 148,
  "اتنا": 149,
  "اتنی": 150,
  "اتنے": 151,
  "اثر": 152,
  "اج": 153,
  "اجا": 154,
  "اجاز": 155,
  "اجازت": 156,
  "اجال": 157,
  "اجالا": 158,
  "اجاڑ": 159,
  "اجزا": 160,
  "اجزائے": 161,
  "اجل": 162,
  "اجن": 163,
  "اجنبی": 164,
  "اجڑ": 165,
  "اجڑے": 166,
  "اح": 167,
  "احباب": 168,
  "احتیا": 169,
  "احتیاط": 170,
  "احس": 171,
  "احساس": 172,
  "احسان": 173,
  "احساں": 174,
  "احوال": 175,
  "اخ": 176,
  "اخبار": 177,
  "اخت": 178,
  "اختلا": 179,
  "اختیار": 180,
  "اخلا": 181,
  "اد": 182,
  "ادا": 183,
  "ادائے": 184,
  "اداس": 185,
  "اداسی": 186,
  "ادب": 187,
  "ادھر": 188,
  "اذ": 189,
  "ار": 190,
  "ارا": 191,
  "ارادہ": 192,
  "ارباب": 193,
  "ارت": 194,
  "ارمان": 195,
  "ارماں": 196,
  "اروں": 197,
  "ارہ": 198,
  "ارۂ": 199,
  "اری": 200,
  "ارے": 201,
  "از": 202,
  "ازل": 203,
  "اس": 204,
  "اسباب": 205,
  "است": 206,
  "استاد": 207,
  "استخواں": 208,
  "استع": 209,
  "استغ": 210,
  "استغنا": 211,
  "استو": 212,
  "اسد": 213,
  "اسدؔ": 214,
  "اسر": 215,
  "اسرار": 216,
  "اسی": 217,
  "اسیر": 218,
  "اسیری": 219,
  "اسے": 220,
  "اش": 221,
  "اشارا": 222,
  "اشارہ": 223,
  "اشارے": 224,
  "اشعار": 225,
  "اشک": 226,
  "اشکوں": 227,
  "اصل": 228,
  "اض": 229,
  "اضط": 230,
  "اضطراب": 231,
  "اظ": 232,
  "اظہار": 233,
  "اع": 234,
  "اعت": 235,
  "اعتبار": 236,
  "اعتم": 237,
  "اعتماد": 238,
  "اعجاز": 239,
  "اغ": 240,
  "اغیار": 241,
  "اف": 242,
  "افتا": 243,
  "افزا": 244,
  "افسانہ": 245,
  "افسانے": 246,
  "افسر": 247,
  "افسردگی": 248,
  "افسردہ": 249,
  "افسوس": 250,
  "افشاں": 251,
  "افق": 252,
  "افلاک": 253,
  "اق": 254,
  "اقبال": 255,
  "اقبالؔ": 256,
  "اقرار": 257,
  "ال": 258,
  "الب": 259,
  "البؔ": 260,
  "الت": 261,
  "التجا": 262,
  "التفات": 263,
  "الجھ": 264,
  "الجھا": 265,
  "الز": 266,
  "الزام": 267,
  "الفاظ": 268,
  "الفت": 269,
  "اللہ": 270,
  "الم": 271,
  "الوں": 272,
  "الٰ": 273,
  "الٰہی": 274,
  "الٹ": 275,
  "الٹی": 276,
  "الگ": 277,
  "الی": 278,
  "الے": 279,
  "ام": 280,
  "امام": 281,
  "اماں": 282,
  "امت": 283,
  "امتح": 284,
  "امتحان": 285,
  "امتحاں": 286,
  "امتیاز": 287,
  "امر": 288,
  "امل": 289,
  "امن": 290,
  "امکاں": 291,
  "امی": 292,
  "امید": 293,
  "امیدو": 294,
  "امیدی": 295,
  "امیدیں": 296,
  "ان": 297,
  "انا": 298,
  "انت": 299,
  "انتخاب": 300,
  "انتظ": 301,
  "انتظار": 302,
  "انتہا": 303,
  "انجام": 304,
  "انجم": 305,
  "انجمن": 306,
  "اند": 307,
  "انداز": 308,
  "اندر": 309,
  "اندوہ": 310,
  "اندھ": 311,
  "اندھی": 312,
  "اندھیرا": 313,
  "اندھیروں": 314,
  "اندھیرے": 315,
  "اندی": 316,
  "اندیش": 317,
  "اندیشہ": 318,
  "اندیشۂ": 319,
  "انس": 320,
  "انسان": 321,
  "انساں": 322,
  "انصاف": 323,
  "انقل": 324,
  "انقلاب": 325,
  "انوں": 326,
  "انکار": 327,
  "انکھ": 328,
  "انگ": 329,
  "انگشت": 330,
  "انگلیاں": 331,
  "انگڑائی": 332,
  "انگی": 333,
  "انگیز": 334,
  "انہ": 335,
  "انہیں": 336,
  "انی": 337,
  "انیاں": 338,
  "انیس": 339,
  "انیسؔ": 340,
  "انے": 341,
  "او": 342,
  "اوج": 343,
  "اور": 344,
  "اوروں": 345,
  "اوق": 346,
  "اوقات": 347,
  "اول": 348,
  "اوپر": 349,
  "اوڑھ": 350,
  "اٹھ": 351,
  "اٹھا": 352,
  "اٹھاؤ": 353,
  "اٹھائی": 354,
  "اٹھائیے": 355,
  "اٹھائے": 356,
  "اٹھاتے": 357,
  "اٹھانا": 358,
  "اٹھانے": 359,
  "اٹھایا": 360,
  "اٹھتا": 361,
  "اٹھتی": 362,
  "اٹھتے": 363,
  "اٹھی": 364,
  "اٹھیں": 365,
  "اٹھے": 366,
  "اپ": 367,
  "اپنا": 368,
  "اپنوں": 369,
  "اپنی": 370,
  "اپنے": 371,
  "اچھ": 372,
  "اچھا": 373,
  "اچھل": 374,
  "اچھی": 375,
  "اچھے": 376,
  "اڑ": 377,
  "اڑا": 378,
  "اڑتی": 379,
  "اڑتے": 380,
  "اڑنے": 381,
  "اڑی": 382,
  "اڑے": 383,
  "اک": 384,
  "اکبر": 385,
  "اکبرؔ": 386,
  "اکثر": 387,
  "اکی": 388,
  "اکیلا": 389,
  "اکیلے": 390,
  "اگر": 391,
  "اگرچہ": 392,
  "اگل": 393,
  "اگلے": 394,
  "اں": 395,
  "اہ": 396,
  "اہر": 397,
  "اہل": 398,
  "ای": 399,
  "ایا": 400,
  "ایام": 401,
  "ایت": 402,
  "ایجا": 403,
  "ایجاد": 404,
  "اید": 405,
  "ایسا": 406,
  "ایسی": 407,
  "ایسے": 408,
  "ایما": 409,
  "ایمان": 410,
  "ایماں": 411,
  "ایک": 412,
  "اے": 413,
  "ب": 414,
  "با": 415,
  "باب": 416,
  "بات": 417,
  "باتوں": 418,
  "باتیں": 419,
  "باد": 420,
  "بادل": 421,
  "بادہ": 422,
  "بادۂ": 423,
  "بادی": 424,
  "بار": 425,
  "بارش": 426,
  "بارہا": 427,
  "باری": 428,
  "بارے": 429,
  "باز": 430,
  "بازار": 431,
  "بازو": 432,
  "بازی": 433,
  "باسی": 434,
  "باش": 435,
  "باطل": 436,
  "باطن": 437,
  "باع": 438,
  "باعث": 439,
  "باغ": 440,
  "باغباں": 441,
  "باقی": 442,
  "بال": 443,
  "بالا": 444,
  "بالیں": 445,
  "بام": 446,
  "بان": 447,
  "باندھ": 448,
  "باندھا": 449,
  "باندھتے": 450,
  "بانٹ": 451,
  "بانہ": 452,
  "بانہوں": 453,
  "بانی": 454,
  "باں": 455,
  "باہ": 456,
  "باہر": 457,
  "بت": 458,
  "بتا": 459,
  "بتاؤ": 460,
  "بتاؤں": 461,
  "بتائیں": 462,
  "بتائے": 463,
  "بتاتے": 464,
  "بتاں": 465,
  "بتلا": 466,
  "بتوں": 467,
  "بج": 468,
  "بجا": 469,
  "بجائے": 470,
  "بجز": 471,
  "بجلی": 472,
  "بجھ": 473,
  "بجھا": 474,
  "بجھے": 475,
  "بح": 476,
  "بحث": 477,
  "بحر": 478,
  "بخ": 479,
  "بخت": 480,
  "بخش": 481,
  "بخشا": 482,
  "بخشش": 483,
  "بخشی": 484,
  "بخشے": 485,
  "بخی": 486,
  "بد": 487,
  "بدر": 488,
  "بدل": 489,
  "بدلا": 490,
  "بدلتے": 491,
  "بدلنے": 492,
  "بدلی": 493,
  "بدلے": 494,
  "بدم": 495,
  "بدن": 496,
  "بدنام": 497,
  "بدہ": 498,
  "بر": 499,
  "برا": 500,
  "برائی": 501,
  "برابر": 502,
  "برباد": 503,
  "برت": 504,
  "برد": 505,
  "برس": 506,
  "برسا": 507,
  "برسات": 508,
  "برسوں": 509,
  "برف": 510,
  "برق": 511,
  "برنگ": 512,
  "برپا": 513,
  "برگ": 514,
  "برہ": 515,
  "برہم": 516,
  "برہمن": 517,
  "برہنہ": 518,
  "بری": 519,
  "برے": 520,
  "بز": 521,
  "بزرگ": 522,
  "بزم": 523,
  "بس": 524,
  "بسا": 525,
  "بساط": 526,
  "بست": 527,
  "بستر": 528,
  "بستی": 529,
  "بستیاں": 530,
  "بسر": 531,
  "بسمل": 532,
  "بسکہ": 533,
  "بسی": 534,
  "بش": 535,
  "بشر": 536,
  "بظاہر": 537,
  "بع": 538,
  "بعد": 539,
  "بغ": 540,
  "بغاو": 541,
  "بغل": 542,
  "بغیر": 543,
  "بقا": 544,
  "بل": 545,
  "بلا": 546,
  "بلائیں": 547,
  "بلائے": 548,
  "بلب": 549,
  "بلبل": 550,
  "بلند": 551,
  "بلندی": 552,
  "بلکہ": 553,
  "بن": 554,
  "بنا": 555,
  "بناؤ": 556,
  "بنائے": 557,
  "بنانے": 558,
  "بنایا": 559,
  "بنتا": 560,
  "بنتی": 561,
  "بند": 562,
  "بندوں": 563,
  "بندگی": 564,
  "بندھ": 565,
  "بندہ": 566,
  "بندۂ": 567,
  "بندی": 568,
  "بندے": 569,
  "بنی": 570,
  "بنے": 571,
  "بو": 572,
  "بوئے": 573,
  "بوجھ": 574,
  "بود": 575,
  "بور": 576,
  "بوریا": 577,
  "بوس": 578,
  "بوسہ": 579,
  "بوسۂ": 580,
  "بول": 581,
  "بولا": 582,
  "بولتا": 583,
  "بولے": 584,
  "بوند": 585,
  "بوں": 586,
  "بٹ": 587,
  "بٹھا": 588,
  "بچ": 589,
  "بچئے": 590,
  "بچا": 591,
  "بچوں": 592,
  "بچپ": 593,
  "بچپن": 594,
  "بچھ": 595,
  "بچھا": 596,
  "بچھڑ": 597,
  "بچھڑے": 598,
  "بچہ": 599,
  "بچے": 600,
  "بڑ": 601,
  "بڑا": 602,
  "بڑھ": 603,
  "بڑھا": 604,
  "بڑھتے": 605,
  "بڑھے": 606,
  "بڑی": 607,
  "بڑے": 608,
  "بکف": 609,
  "بکھ": 610,
  "بکھر": 611,
  "بکھرنے": 612,
  "بگ": 613,
  "بگو": 614,
  "بگڑ": 615,
  "بگڑی": 616,
  "بھ": 617,
  "بھا": 618,
  "بھاری": 619,
  "بھر": 620,
  "بھرا": 621,
  "بھرم": 622,
  "بھرو": 623,
  "بھروسا": 624,
  "بھری": 625,
  "بھرے": 626,
  "بھلا": 627,
  "بھلی": 628,
  "بھنور": 629,
  "بھو": 630,
  "بھول": 631,
  "بھولا": 632,
  "بھولنے": 633,
  "بھولی": 634,
  "بھولے": 635,
  "بھٹک": 636,
  "بھڑ": 637,
  "بھڑک": 638,
  "بھگو": 639,
  "بھی": 640,
  "بھی<eos>": 641,
  "بھیجی": 642,
  "بھید": 643,
  "بھیس": 644,
  "بھیڑ": 645,
  "بھیگ": 646,
  "بھیگتا": 647,
  "بہ": 648,
  "بہا": 649,
  "بہار": 650,
  "بہاروں": 651,
  "بہاری": 652,
  "بہانہ": 653,
  "بہانے": 654,
  "بہت": 655,
  "بہتا": 656,
  "بہتر": 657,
  "بہتے": 658,
  "بہر": 659,
  "بہشت": 660,
  "بہل": 661,
  "بہلا": 662,
  "بہم": 663,
  "بہک": 664,
  "بہہ": 665,
  "بۂ": 666,
  "بی": 667,
  "بیا": 668,
  "بیابان": 669,
  "بیاباں": 670,
  "بیان": 671,
  "بیاں": 672,
  "بیت": 673,
  "بیتاب": 674,
  "بیتابی": 675,
  "بیتے": 676,
  "بیداد": 677,
  "بیدار": 678,
  "بیدل": 679,
  "بیر": 680,
  "بیزار": 681,
  "بیض": 682,
  "بیل": 683,
  "بیم": 684,
  "بیمار": 685,
  "بیماری": 686,
  "بین": 687,
  "بینا": 688,
  "بینائی": 689,
  "بینوں": 690,
  "بینی": 691,
  "بیٰ": 692,
  "بیٹھ": 693,
  "بیٹھا": 694,
  "بیٹھے": 695,
  "بیچ": 696,
  "بیکسی": 697,
  "بیگان": 698,
  "بیگانگی": 699,
  "بیگانہ": 700,
  "بیگانۂ": 701,
  "بیگانے": 702,
  "بیں": 703,
  "بے": 704,
  "ت": 705,
  "تأ": 706,
  "تئیں": 707,
  "تا": 708,
  "تاب": 709,
  "تابی": 710,
  "تاث": 711,
  "تاثیر": 712,
  "تاج": 713,
  "تاخیر": 714,
  "تاد": 715,
  "تار": 716,
  "تارا": 717,
  "تاروں": 718,
  "تاری": 719,
  "تاریخ": 720,
  "تارے": 721,
  "تازہ": 722,
  "تان": 723,
  "تاک": 724,
  "تاں": 725,
  "تب": 726,
  "تباہ": 727,
  "تبسم": 728,
  "تج": 729,
  "تجر": 730,
  "تجلی": 731,
  "تجھ": 732,
  "تجھی": 733,
  "تجھے": 734,
  "تح": 735,
  "تحری": 736,
  "تحریر": 737,
  "تخت": 738,
  "تد": 739,
  "تدبیر": 740,
  "تذکر": 741,
  "تر": 742,
  "ترا": 743,
  "تربت": 744,
  "ترک": 745,
  "تری": 746,
  "ترے": 747,
  "تس": 748,
  "تسبی": 749,
  "تسبیح": 750,
  "تسخیر": 751,
  "تسلی": 752,
  "تسلیم": 753,
  "تسکین": 754,
  "تسکیں": 755,
  "تش": 756,
  "تشنگی": 757,
  "تشنہ": 758,
  "تشنۂ": 759,
  "تصو": 760,
  "تصور": 761,
  "تصویر": 762,
  "تع": 763,
  "تعبیر": 764,
  "تعجب": 765,
  "تعل": 766,
  "تعلق": 767,
  "تعمیر": 768,
  "تغافل": 769,
  "تف": 770,
  "تق": 771,
  "تقا": 772,
  "تقاضا": 773,
  "تقاضائے": 774,
  "تقدیر": 775,
  "تقریب": 776,
  "تقریر": 777,
  "تل": 778,
  "تلا": 779,
  "تلاش": 780,
  "تلخ": 781,
  "تلو": 782,
  "تلوار": 783,
  "تلک": 784,
  "تلے": 785,
  "تم": 786,
  "تما": 787,
  "تماشا": 788,
  "تماشائی": 789,
  "تماشائے": 790,
  "تمام": 791,
  "تمث": 792,
  "تمثال": 793,
  "تمنا": 794,
  "تمنائے": 795,
  "تمہ": 796,
  "تمہارا": 797,
  "تمہاری": 798,
  "تمہارے": 799,
  "تمہیں": 800,
  "تن": 801,
  "تند": 802,
  "تنگ": 803,
  "تنہا": 804,
  "تنہائی": 805,
  "تو": 806,
  "توبہ": 807,
  "توجہ": 808,
  "توفیق": 809,
  "توق": 810,
  "توقع": 811,
  "تول": 812,
  "تون": 813,
  "توڑ": 814,
  "توڑا": 815,
  "توں": 816,
  "تپ": 817,
  "تپاک": 818,
  "تپش": 819,
  "تڑ": 820,
  "تڑپ": 821,
  "تک": 822,
  "تکر": 823,
  "تکرار": 824,
  "تکلف": 825,
  "تکلیف": 826,
  "تھ": 827,
  "تھا": 828,
  "تھا<eos>": 829,
  "تھام": 830,
  "تھر": 831,
  "تھو": 832,
  "تھوڑا": 833,
  "تھوڑی": 834,
  "تھک": 835,
  "تھکن": 836,
  "تھی": 837,
  "تھی<eos>": 838,
  "تھیں": 839,
  "تھے": 840,
  "تہ": 841,
  "تہذ": 842,
  "تہذیب": 843,
  "تہمت": 844,
  "تہہ": 845,
  "تہی": 846,
  "تی": 847,
  "تیا": 848,
  "تیار": 849,
  "تیر": 850,
  "تیرا": 851,
  "تیرگی": 852,
  "تیرہ": 853,
  "تیری": 854,
  "تیرے": 855,
  "تیز": 856,
  "تیغ": 857,
  "تیور": 858,
  "تیٔ": 859,
  "تیں": 860,
  "تے": 861,
  "ث": 862,
  "ثابت": 863,
  "ثار": 864,
  "ثبات": 865,
  "ثر": 866,
  "ثمر": 867,
  "ثواب": 868,
  "ج": 869,
  "جئے": 870,
  "جا": 871,
  "جاؤ": 872,
  "جاؤں": 873,
  "جائیں": 874,
  "جائیے": 875,
  "جائے": 876,
  "جائے<eos>": 877,
  "جات": 878,
  "جاتا": 879,
  "جاتی": 880,
  "جاتے": 881,
  "جادو": 882,
  "جادہ": 883,
  "جادۂ": 884,
  "جاری": 885,
  "جاز": 886,
  "جال": 887,
  "جالبؔ": 888,
  "جام": 889,
  "جامۂ": 890,
  "جان": 891,
  "جانئے": 892,
  "جانا": 893,
  "جاناں": 894,
  "جانب": 895,
  "جانتا": 896,
  "جانتے": 897,
  "جانو": 898,
  "جانوں": 899,
  "جانی": 900,
  "جانیں": 901,
  "جانیے": 902,
  "جانے": 903,
  "جاو": 904,
  "جاوید": 905,
  "جاوے": 906,
  "جاگ": 907,
  "جاگتا": 908,
  "جاگے": 909,
  "جاں": 910,
  "جاہ": 911,
  "جب": 912,
  "جبر": 913,
  "جبیں": 914,
  "جت": 915,
  "جتنا": 916,
  "جتنی": 917,
  "جتنے": 918,
  "جد": 919,
  "جدا": 920,
  "جدائی": 921,
  "جدھر": 922,
  "جذ": 923,
  "جذب": 924,
  "جذبات": 925,
  "جذبۂ": 926,
  "جر": 927,
  "جرأ": 928,
  "جرأت": 929,
  "جراحت": 930,
  "جرم": 931,
  "جز": 932,
  "جزا": 933,
  "جس": 934,
  "جست": 935,
  "جستجو": 936,
  "جستہ": 937,
  "جسم": 938,
  "جسے": 939,
  "جشن": 940,
  "جفا": 941,
  "جفائیں": 942,
  "جل": 943,
  "جلا": 944,
  "جلائے": 945,
  "جلاد": 946,
  "جلتا": 947,
  "جلتی": 948,
  "جلتے": 949,
  "جلد": 950,
  "جلدی": 951,
  "جلس": 952,
  "جلنے": 953,
  "جلو": 954,
  "جلوہ": 955,
  "جلوۂ": 956,
  "جلوے": 957,
  "جلی": 958,
  "جلے": 959,
  "جم": 960,
  "جمال": 961,
  "جمع": 962,
  "جمن": 963,
  "جن": 964,
  "جناب": 965,
  "جناز": 966,
  "جنبش": 967,
  "جنت": 968,
  "جنس": 969,
  "جنون": 970,
  "جنوں": 971,
  "جنگ": 972,
  "جنگل": 973,
  "جنہیں": 974,
  "جو": 975,
  "جوئی": 976,
  "جواب": 977,
  "جوانی": 978,
  "جواں": 979,
  "جواہر": 980,
  "جود": 981,
  "جور": 982,
  "جوش": 983,
  "جول": 984,
  "جولاں": 985,
  "جوم": 986,
  "جون": 987,
  "جونؔ": 988,
  "جوں": 989,
  "جوہر": 990,
  "جگ": 991,
  "جگا": 992,
  "جگر": 993,
  "جگرؔ": 994,
  "جگنو": 995,
  "جگہ": 996,
  "جھ": 997,
  "جھا": 998,
  "جھان": 999,
  "جھل": 1000,
  "جھلک": 1001,
  "جھوم": 1002,
  "جھون": 1003,
  "جھونکا": 1004,
  "جھوٹ": 1005,
  "جھوٹا": 1006,
  "جھک": 1007,
  "جھکا": 1008,
  "جھگ": 1009,
  "جھگڑا": 1010,
  "جھی": 1011,
  "جہ": 1012,
  "جہان": 1013,
  "جہاں": 1014,
  "جہت": 1015,
  "جہنم": 1016,
  "جی": 1017,
  "جیب": 1018,
  "جیت": 1019,
  "جیتا": 1020,
  "جیتے": 1021,
  "جیسا": 1022,
  "جیسی": 1023,
  "جیسے": 1024,
  "جینا": 1025,
  "جینے": 1026,
  "جیون": 1027,
  "جیوں": 1028,
  "جیے": 1029,
  "جے": 1030,
  "ح": 1031,
  "حا": 1032,
  "حائل": 1033,
  "حاجت": 1034,
  "حاد": 1035,
  "حادث": 1036,
  "حادثہ": 1037,
  "حاصل": 1038,
  "حاضر": 1039,
  "حال": 1040,
  "حالات": 1041,
  "حالت": 1042,
  "حالی": 1043,
  "حالیؔ": 1044,
  "حاک": 1045,
  "حاکم": 1046,
  "حباب": 1047,
  "حت": 1048,
  "حجا": 1049,
  "حجاب": 1050,
  "حد": 1051,
  "حدی": 1052,
  "حدیث": 1053,
  "حر": 1054,
  "حرام": 1055,
  "حرص": 1056,
  "حرف": 1057,
  "حرم": 1058,
  "حری": 1059,
  "حریف": 1060,
  "حریم": 1061,
  "حس": 1062,
  "حساب": 1063,
  "حسرت": 1064,
  "حسن": 1065,
  "حسی": 1066,
  "حسین": 1067,
  "حسینوں": 1068,
  "حسیں": 1069,
  "حشر": 1070,
  "حصے": 1071,
  "حض": 1072,
  "حضر": 1073,
  "حضرت": 1074,
  "حضور": 1075,
  "حق": 1076,
  "حقی": 1077,
  "حقیقت": 1078,
  "حل": 1079,
  "حلق": 1080,
  "حلقہ": 1081,
  "حلقۂ": 1082,
  "حلقے": 1083,
  "حنا": 1084,
  "حواد": 1085,
  "حوادث": 1086,
  "حواس": 1087,
  "حور": 1088,
  "حوص": 1089,
  "حوصل": 1090,
  "حوصلہ": 1091,
  "حوصلے": 1092,
  "حکایت": 1093,
  "حکم": 1094,
  "حکمت": 1095,
  "حکو": 1096,
  "حکومت": 1097,
  "حہ": 1098,
  "حۂ": 1099,
  "حی": 1100,
  "حیا": 1101,
  "حیات": 1102,
  "حیدر": 1103,
  "حیدرؔ": 1104,
  "حیر": 1105,
  "حیران": 1106,
  "حیراں": 1107,
  "حیرت": 1108,
  "حیف": 1109,
  "حیواں": 1110,
  "خ": 1111,
  "خا": 1112,
  "خاب": 1113,
  "خار": 1114,
  "خاشاک": 1115,
  "خاص": 1116,
  "خاطر": 1117,
  "خال": 1118,
  "خالی": 1119,
  "خام": 1120,
  "خامشی": 1121,
  "خاموش": 1122,
  "خاموشی": 1123,
  "خامہ": 1124,
  "خامۂ": 1125,
  "خان": 1126,
  "خانماں": 1127,
  "خانوں": 1128,
  "خانہ": 1129,
  "خانۂ": 1130,
  "خانے": 1131,
  "خاک": 1132,
  "خاکساری": 1133,
  "خاکی": 1134,
  "خبر": 1135,
  "خبری": 1136,
  "خت": 1137,
  "ختم": 1138,
  "ختن": 1139,
  "ختہ": 1140,
  "خد": 1141,
  "خدا": 1142,
  "خدائی": 1143,
  "خدایا": 1144,
  "خر": 1145,
  "خرا": 1146,
  "خراب": 1147,
  "خرابات": 1148,
  "خرابی": 1149,
  "خراش": 1150,
  "خرام": 1151,
  "خرد": 1152,
  "خرمن": 1153,
  "خری": 1154,
  "خریدار": 1155,
  "خز": 1156,
  "خزاں": 1157,
  "خس": 1158,
  "خستہ": 1159,
  "خسرو": 1160,
  "خشت": 1161,
  "خشک": 1162,
  "خص": 1163,
  "خضر": 1164,
  "خط": 1165,
  "خطا": 1166,
  "خطاب": 1167,
  "خطر": 1168,
  "خطرہ": 1169,
  "خطرے": 1170,
  "خفا": 1171,
  "خل": 1172,
  "خلا": 1173,
  "خلاف": 1174,
  "خلد": 1175,
  "خلش": 1176,
  "خلق": 1177,
  "خلقت": 1178,
  "خلو": 1179,
  "خلوت": 1180,
  "خلوص": 1181,
  "خم": 1182,
  "خمار": 1183,
  "خمو": 1184,
  "خموشی": 1185,
  "خمیا": 1186,
  "خمیازہ": 1187,
  "خن": 1188,
  "خنجر": 1189,
  "خند": 1190,
  "خندہ": 1191,
  "خندۂ": 1192,
  "خو": 1193,
  "خواب": 1194,
  "خوابوں": 1195,
  "خوابی": 1196,
  "خوابیدہ": 1197,
  "خوار": 1198,
  "خواری": 1199,
  "خواں": 1200,
  "خواہ": 1201,
  "خواہش": 1202,
  "خواہشوں": 1203,
  "خوب": 1204,
  "خوباں": 1205,
  "خوبصورت": 1206,
  "خوبی": 1207,
  "خود": 1208,
  "خودکشی": 1209,
  "خودی": 1210,
  "خور": 1211,
  "خورشید": 1212,
  "خوش": 1213,
  "خوشا": 1214,
  "خوشب": 1215,
  "خوشبو": 1216,
  "خوشی": 1217,
  "خوف": 1218,
  "خون": 1219,
  "خونیں": 1220,
  "خوں": 1221,
  "خی": 1222,
  "خیا": 1223,
  "خیال": 1224,
  "خیالوں": 1225,
  "خیر": 1226,
  "خیز": 1227,
  "خیمے": 1228,
  "د": 1229,
  "دا": 1230,
  "دائم": 1231,
  "دات": 1232,
  "داد": 1233,
  "دار": 1234,
  "دارا": 1235,
  "داری": 1236,
  "داز": 1237,
  "داس": 1238,
  "داستان": 1239,
  "داستاں": 1240,
  "داغ": 1241,
  "داغؔ": 1242,
  "دال": 1243,
  "دام": 1244,
  "دامان": 1245,
  "داماں": 1246,
  "دامن": 1247,
  "دان": 1248,
  "دانا": 1249,
  "دانش": 1250,
  "دانہ": 1251,
  "دانی": 1252,
  "داں": 1253,
  "دب": 1254,
  "دبا": 1255,
  "دبے": 1256,
  "دت": 1257,
  "دخل": 1258,
  "در": 1259,
  "دراز": 1260,
  "درباں": 1261,
  "درجہ": 1262,
  "درد": 1263,
  "درس": 1264,
  "درمیاں": 1265,
  "درواز": 1266,
  "دروازہ": 1267,
  "دروازے": 1268,
  "دروں": 1269,
  "درویش": 1270,
  "درپیش": 1271,
  "درکار": 1272,
  "دری": 1273,
  "دریا": 1274,
  "دریائے": 1275,
  "دس": 1276,
  "دست": 1277,
  "دستار": 1278,
  "دستک": 1279,
  "دش": 1280,
  "دشت": 1281,
  "دشم": 1282,
  "دشمن": 1283,
  "دشمنوں": 1284,
  "دشمنی": 1285,
  "دشوار": 1286,
  "دع": 1287,
  "دعا": 1288,
  "دعائیں": 1289,
  "دعوت": 1290,
  "دعوی": 1291,
  "دعویٰ": 1292,
  "دفت": 1293,
  "دفتر": 1294,
  "دفن": 1295,
  "دل": 1296,
  "دلا": 1297,
  "دلبر": 1298,
  "دلبری": 1299,
  "دلوں": 1300,
  "دلی": 1301,
  "دم": 1302,
  "دما": 1303,
  "دماغ": 1304,
  "دن": 1305,
  "دند": 1306,
  "دنداں": 1307,
  "دنوں": 1308,
  "دنیا": 1309,
  "دو": 1310,
  "دوا": 1311,
  "دوام": 1312,
  "دود": 1313,
  "دور": 1314,
  "دوراں": 1315,
  "دوری": 1316,
  "دوزخ": 1317,
  "دوس": 1318,
  "دوست": 1319,
  "دوستو": 1320,
  "دوستوں": 1321,
  "دوستی": 1322,
  "دوسرا": 1323,
  "دوش": 1324,
  "دولت": 1325,
  "دونوں": 1326,
  "دوں": 1327,
  "دي": 1328,
  "دکان": 1329,
  "دکاں": 1330,
  "دکھ": 1331,
  "دکھا": 1332,
  "دکھائی": 1333,
  "دکھائیں": 1334,
  "دکھائے": 1335,
  "دکھاتا": 1336,
  "دکھاتی": 1337,
  "دکھانے": 1338,
  "دکھایا": 1339,
  "دکھلا": 1340,
  "دکھے": 1341,
  "دگاں": 1342,
  "دگر": 1343,
  "دگی": 1344,
  "دھ": 1345,
  "دھا": 1346,
  "دھر": 1347,
  "دھرا": 1348,
  "دھرتی": 1349,
  "دھن": 1350,
  "دھنک": 1351,
  "دھو": 1352,
  "دھواں": 1353,
  "دھول": 1354,
  "دھوپ": 1355,
  "دھوکا": 1356,
  "دھوکے": 1357,
  "دھڑ": 1358,
  "دھڑک": 1359,
  "دھڑکتا": 1360,
  "دھڑکن": 1361,
  "دھی": 1362,
  "دھیان": 1363,
  "دھیرے": 1364,
  "دہ": 1365,
  "دہا": 1366,
  "دہائی": 1367,
  "دہان": 1368,
  "دہر": 1369,
  "دہق": 1370,
  "دہلی": 1371,
  "دہن": 1372,
  "دۂ": 1373,
  "دی": 1374,
  "دیئے": 1375,
  "دیا": 1376,
  "دیا<eos>": 1377,
  "دیار": 1378,
  "دیتا": 1379,
  "دیتی": 1380,
  "دیتے": 1381,
  "دیجئے": 1382,
  "دید": 1383,
  "دیدار": 1384,
  "دیدہ": 1385,
  "دیدۂ": 1386,
  "دیر": 1387,
  "دین": 1388,
  "دینا": 1389,
  "دینے": 1390,
  "دیو": 1391,
  "دیوار": 1392,
  "دیواروں": 1393,
  "دیوان": 1394,
  "دیوانوں": 1395,
  "دیوانگی": 1396,
  "دیوانہ": 1397,
  "دیوانے": 1398,
  "دیکھ": 1399,
  "دیکھا": 1400,
  "دیکھتا": 1401,
  "دیکھتے": 1402,
  "دیکھنا": 1403,
  "دیکھنے": 1404,
  "دیکھو": 1405,
  "دیکھوں": 1406,
  "دیکھی": 1407,
  "دیکھیں": 1408,
  "دیکھیے": 1409,
  "دیکھے": 1410,
  "دیں": 1411,
  "دیے": 1412,
  "دے": 1413,
  "دے<eos>": 1414,
  "ذ": 1415,
  "ذا": 1416,
  "ذات": 1417,
  "ذر": 1418,
  "ذرا": 1419,
  "ذرہ": 1420,
  "ذرے": 1421,
  "ذلت": 1422,
  "ذوق": 1423,
  "ذکر": 1424,
  "ذہن": 1425,
  "ر": 1426,
  "را": 1427,
  "رائی": 1428,
  "رائیگاں": 1429,
  "رائے": 1430,
  "راب": 1431,
  "رات": 1432,
  "راتوں": 1433,
  "راتیں": 1434,
  "راج": 1435,
  "راحت": 1436,
  "راز": 1437,
  "رازداں": 1438,
  "رازی": 1439,
  "راس": 1440,
  "راستوں": 1441,
  "راستہ": 1442,
  "راستے": 1443,
  "راضی": 1444,
  "راغ": 1445,
  "راق": 1446,
  "رام": 1447,
  "رانہ": 1448,
  "راک": 1449,
  "راکھ": 1450,
  "راگ": 1451,
  "راں": 1452,
  "راہ": 1453,
  "راہن": 1454,
  "راہوں": 1455,
  "راہی": 1456,
  "رب": 1457,
  "ربا": 1458,
  "ربائی": 1459,
  "ربط": 1460,
  "رت": 1461,
  "رح": 1462,
  "رحم": 1463,
  "رحمت": 1464,
  "رخ": 1465,
  "رخسار": 1466,
  "رخصت": 1467,
  "رخی": 1468,
  "ردا": 1469,
  "رز": 1470,
  "رزق": 1471,
  "رس": 1472,
  "رسا": 1473,
  "رسائی": 1474,
  "رستہ": 1475,
  "رستے": 1476,
  "رسم": 1477,
  "رسن": 1478,
  "رسوا": 1479,
  "رسوائی": 1480,
  "رشتوں": 1481,
  "رشتہ": 1482,
  "رشتۂ": 1483,
  "رشتے": 1484,
  "رشک": 1485,
  "رض": 1486,
  "رضا": 1487,
  "رضواں": 1488,
  "رعنا": 1489,
  "رعنائی": 1490,
  "رفا": 1491,
  "رفاقت": 1492,
  "رفت": 1493,
  "رفتار": 1494,
  "رفتہ": 1495,
  "رفو": 1496,
  "رفیق": 1497,
  "رق": 1498,
  "رقص": 1499,
  "رقم": 1500,
  "رقی": 1501,
  "رقیب": 1502,
  "رقیبوں": 1503,
  "رم": 1504,
  "رمز": 1505,
  "رن": 1506,
  "رنج": 1507,
  "رنجش": 1508,
  "رنجور": 1509,
  "رند": 1510,
  "رندان": 1511,
  "رنگ": 1512,
  "رنگی": 1513,
  "رنگیں": 1514,
  "رو": 1515,
  "روئیں": 1516,
  "روئے": 1517,
  "روا": 1518,
  "روانی": 1519,
  "رواں": 1520,
  "روب": 1521,
  "روبرو": 1522,
  "روتا": 1523,
  "روتے": 1524,
  "روح": 1525,
  "روداد": 1526,
  "روز": 1527,
  "روزن": 1528,
  "روزگار": 1529,
  "روش": 1530,
  "روشن": 1531,
  "روشنی": 1532,
  "رونا": 1533,
  "رونق": 1534,
  "رونے": 1535,
  "روٹھ": 1536,
  "روپ": 1537,
  "روک": 1538,
  "روکے": 1539,
  "روگ": 1540,
  "روں": 1541,
  "روی": 1542,
  "رویا": 1543,
  "رک": 1544,
  "رکا": 1545,
  "رکھ": 1546,
  "رکھا": 1547,
  "رکھتا": 1548,
  "رکھتی": 1549,
  "رکھتے": 1550,
  "رکھنا": 1551,
  "رکھنے": 1552,
  "رکھوں": 1553,
  "رکھی": 1554,
  "رکھے": 1555,
  "رکے": 1556,
  "رگ": 1557,
  "رہ": 1558,
  "رہا": 1559,
  "رہا<eos>": 1560,
  "رہائی": 1561,
  "رہبر": 1562,
  "رہتا": 1563,
  "رہتی": 1564,
  "رہتے": 1565,
  "رہرو": 1566,
  "رہزن": 1567,
  "رہن": 1568,
  "رہنا": 1569,
  "رہنما": 1570,
  "رہنے": 1571,
  "رہو": 1572,
  "رہوں": 1573,
  "رہی": 1574,
  "رہیں": 1575,
  "رہے": 1576,
  "ری": 1577,
  "ریا": 1578,
  "ریب": 1579,
  "ریت": 1580,
  "ریر": 1581,
  "ریز": 1582,
  "ریزہ": 1583,
  "ریف": 1584,
  "ریں": 1585,
  "رے": 1586,
  "ز": 1587,
  "زا": 1588,
  "زاد": 1589,
  "زار": 1590,
  "زاری": 1591,
  "زان": 1592,
  "زانو": 1593,
  "زانہ": 1594,
  "زاں": 1595,
  "زاہ": 1596,
  "زاہد": 1597,
  "زبان": 1598,
  "زبانی": 1599,
  "زباں": 1600,
  "زخ": 1601,
  "زخم": 1602,
  "زخموں": 1603,
  "زخمی": 1604,
  "زد": 1605,
  "زدہ": 1606,
  "زر": 1607,
  "زرد": 1608,
  "زعم": 1609,
  "زل": 1610,
  "زلف": 1611,
  "زلفاں": 1612,
  "زلفوں": 1613,
  "زلفیں": 1614,
  "زلی": 1615,
  "زلیخا": 1616,
  "زم": 1617,
  "زما": 1618,
  "زمان": 1619,
  "زمانا": 1620,
  "زمانہ": 1621,
  "زمانے": 1622,
  "زمزم": 1623,
  "زمی": 1624,
  "زمین": 1625,
  "زمینوں": 1626,
  "زمیں": 1627,
  "زن": 1628,
  "زنار": 1629,
  "زنج": 1630,
  "زنجیر": 1631,
  "زند": 1632,
  "زنداں": 1633,
  "زندگانی": 1634,
  "زندگی": 1635,
  "زندہ": 1636,
  "زنی": 1637,
  "زو": 1638,
  "زوال": 1639,
  "زود": 1640,
  "زور": 1641,
  "زگی": 1642,
  "زہ": 1643,
  "زہد": 1644,
  "زہر": 1645,
  "زہے": 1646,
  "زی": 1647,
  "زیا": 1648,
  "زیادہ": 1649,
  "زیاں": 1650,
  "زیبا": 1651,
  "زیر": 1652,
  "زیست": 1653,
  "زینت": 1654,
  "زیں": 1655,
  "زے": 1656,
  "س": 1657,
  "سا": 1658,
  "سائل": 1659,
  "سائی": 1660,
  "سائے": 1661,
  "ساتھ": 1662,
  "ساتھ<eos>": 1663,
  "ساحل": 1664,
  "سادگی": 1665,
  "سادہ": 1666,
  "سار": 1667,
  "سارا": 1668,
  "ساری": 1669,
  "سارے": 1670,
  "ساز": 1671,
  "سازی": 1672,
  "ساعت": 1673,
  "ساغر": 1674,
  "ساقی": 1675,
  "ساقیا": 1676,
  "سال": 1677,
  "سام": 1678,
  "سامان": 1679,
  "ساماں": 1680,
  "سامنا": 1681,
  "سامنے": 1682,
  "سان": 1683,
  "سانس": 1684,
  "سانسوں": 1685,
  "سانسیں": 1686,
  "سانپ": 1687,
  "سانہ": 1688,
  "سانۂ": 1689,
  "سانے": 1690,
  "ساں": 1691,
  "سای": 1692,
  "سایا": 1693,
  "سایہ": 1694,
  "سایۂ": 1695,
  "سب": 1696,
  "سبب": 1697,
  "سبحہ": 1698,
  "سبز": 1699,
  "سبزہ": 1700,
  "سبزۂ": 1701,
  "سبق": 1702,
  "سبو": 1703,
  "سبک": 1704,
  "سبھی": 1705,
  "ست": 1706,
  "ستا": 1707,
  "ستائش": 1708,
  "ستاروں": 1709,
  "ستارہ": 1710,
  "ستارے": 1711,
  "ستان": 1712,
  "ستانہ": 1713,
  "ستاں": 1714,
  "ستم": 1715,
  "ستوں": 1716,
  "ستگی": 1717,
  "ستہ": 1718,
  "ستی": 1719,
  "ستے": 1720,
  "سج": 1721,
  "سجا": 1722,
  "سجانے": 1723,
  "سجدہ": 1724,
  "سجدے": 1725,
  "سجن": 1726,
  "سحر": 1727,
  "سحری": 1728,
  "سخ": 1729,
  "سخت": 1730,
  "سخن": 1731,
  "سدا": 1732,
  "سدھ": 1733,
  "سر": 1734,
  "سرا": 1735,
  "سراب": 1736,
  "سراسر": 1737,
  "سراغ": 1738,
  "سراپا": 1739,
  "سرت": 1740,
  "سرخ": 1741,
  "سرد": 1742,
  "سرشار": 1743,
  "سرشک": 1744,
  "سرمہ": 1745,
  "سرو": 1746,
  "سرور": 1747,
  "سروں": 1748,
  "سرکار": 1749,
  "سرگرم": 1750,
  "سری": 1751,
  "سزا": 1752,
  "سعی": 1753,
  "سف": 1754,
  "سفاک": 1755,
  "سفر": 1756,
  "سفی": 1757,
  "سل": 1758,
  "سلا": 1759,
  "سلام": 1760,
  "سلامت": 1761,
  "سلس": 1762,
  "سلسلہ": 1763,
  "سلط": 1764,
  "سلطنت": 1765,
  "سلوک": 1766,
  "سلی": 1767,
  "سلیقہ": 1768,
  "سم": 1769,
  "سما": 1770,
  "سماں": 1771,
  "سمت": 1772,
  "سمجھ": 1773,
  "سمجھا": 1774,
  "سمجھتا": 1775,
  "سمجھتے": 1776,
  "سمجھنے": 1777,
  "سمجھو": 1778,
  "سمجھیں": 1779,
  "سمجھے": 1780,
  "سمندر": 1781,
  "سمندروں": 1782,
  "سمٹ": 1783,
  "سمی": 1784,
  "سن": 1785,
  "سنا": 1786,
  "سنائی": 1787,
  "سنائیں": 1788,
  "سنائے": 1789,
  "سنانے": 1790,
  "سناٹا": 1791,
  "سناں": 1792,
  "سنبھ": 1793,
  "سنبھال": 1794,
  "سنبھالے": 1795,
  "سنبھل": 1796,
  "سنتا": 1797,
  "سنتے": 1798,
  "سنج": 1799,
  "سننا": 1800,
  "سننے": 1801,
  "سنو": 1802,
  "سنوار": 1803,
  "سنور": 1804,
  "سنگ": 1805,
  "سنی": 1806,
  "سنے": 1807,
  "سو": 1808,
  "سوئی": 1809,
  "سوئیں": 1810,
  "سوئے": 1811,
  "سوا": 1812,
  "سوائے": 1813,
  "سوار": 1814,
  "سواری": 1815,
  "سوال": 1816,
  "سوتے": 1817,
  "سوختہ": 1818,
  "سود": 1819,
  "سودا": 1820,
  "سودائے": 1821,
  "سور": 1822,
  "سورج": 1823,
  "سوز": 1824,
  "سوزن": 1825,
  "سوس": 1826,
  "سون": 1827,
  "سونا": 1828,
  "سوچ": 1829,
  "سوچا": 1830,
  "سوچتا": 1831,
  "سوچو": 1832,
  "سوچوں": 1833,
  "سوں": 1834,
  "سوی": 1835,
  "سویدا": 1836,
  "سپ": 1837,
  "سپر": 1838,
  "سچ": 1839,
  "سڑک": 1840,
  "سک": 1841,
  "سکا": 1842,
  "سکتا": 1843,
  "سکتی": 1844,
  "سکتے": 1845,
  "سکن": 1846,
  "سکندر": 1847,
  "سکو": 1848,
  "سکوت": 1849,
  "سکون": 1850,
  "سکوں": 1851,
  "سکھ": 1852,
  "سکھا": 1853,
  "سکی": 1854,
  "سکیں": 1855,
  "سکے": 1856,
  "سہ": 1857,
  "سہارا": 1858,
  "سہارے": 1859,
  "سہل": 1860,
  "سہی": 1861,
  "سی": 1862,
  "سیا": 1863,
  "سیاست": 1864,
  "سیاہ": 1865,
  "سیاہی": 1866,
  "سیدھی": 1867,
  "سیر": 1868,
  "سیل": 1869,
  "سیلاب": 1870,
  "سیم": 1871,
  "سیماب": 1872,
  "سینہ": 1873,
  "سینۂ": 1874,
  "سینے": 1875,
  "سیٰ": 1876,
  "سیکڑ": 1877,
  "سیکڑوں": 1878,
  "سیکھ": 1879,
  "سیکھا": 1880,
  "سیں": 1881,
  "سیہ": 1882,
  "سے": 1883,
  "سے<eos>": 1884,
  "ش": 1885,
  "شا": 1886,
  "شائ": 1887,
  "شاخ": 1888,
  "شاخوں": 1889,
  "شاد": 1890,
  "شاداب": 1891,
  "شادمانی": 1892,
  "شادی": 1893,
  "شار": 1894,
  "شاع": 1895,
  "شاعر": 1896,
  "شاعری": 1897,
  "شاق": 1898,
  "شام": 1899,
  "شامل": 1900,
  "شان": 1901,
  "شانہ": 1902,
  "شانی": 1903,
  "شانے": 1904,
  "شاک": 1905,
  "شاں": 1906,
  "شاہ": 1907,
  "شاہد": 1908,
  "شاہی": 1909,
  "شاید": 1910,
  "شب": 1911,
  "شباب": 1912,
  "شبستاں": 1913,
  "شبنم": 1914,
  "شت": 1915,
  "شتر": 1916,
  "شتوں": 1917,
  "شتہ": 1918,
  "شتۂ": 1919,
  "شتے": 1920,
  "شجر": 1921,
  "شخص": 1922,
  "شد": 1923,
  "شدت": 1924,
  "شر": 1925,
  "شرا": 1926,
  "شراب": 1927,
  "شرابی": 1928,
  "شرار": 1929,
  "شرارت": 1930,
  "شرافت": 1931,
  "شرح": 1932,
  "شرر": 1933,
  "شرط": 1934,
  "شرم": 1935,
  "شرما": 1936,
  "شرمند": 1937,
  "شرمندہ": 1938,
  "شری": 1939,
  "شریک": 1940,
  "شش": 1941,
  "شع": 1942,
  "شعا": 1943,
  "شعار": 1944,
  "شعاع": 1945,
  "شعر": 1946,
  "شعل": 1947,
  "شعلوں": 1948,
  "شعلہ": 1949,
  "شعلۂ": 1950,
  "شعلے": 1951,
  "شغل": 1952,
  "شفا": 1953,
  "شفق": 1954,
  "شق": 1955,
  "شم": 1956,
  "شمار": 1957,
  "شمشیر": 1958,
  "شمع": 1959,
  "شمعیں": 1960,
  "شن": 1961,
  "شنا": 1962,
  "شناس": 1963,
  "شو": 1964,
  "شوخ": 1965,
  "شوخی": 1966,
  "شوخیٔ": 1967,
  "شور": 1968,
  "شورش": 1969,
  "شوری": 1970,
  "شوریدہ": 1971,
  "شوق": 1972,
  "شک": 1973,
  "شکار": 1974,
  "شکایت": 1975,
  "شکر": 1976,
  "شکست": 1977,
  "شکستہ": 1978,
  "شکل": 1979,
  "شکن": 1980,
  "شکو": 1981,
  "شکوہ": 1982,
  "شکوۂ": 1983,
  "شکوے": 1984,
  "شکی": 1985,
  "شکیبا": 1986,
  "شگفت": 1987,
  "شگو": 1988,
  "شہ": 1989,
  "شہا": 1990,
  "شہادت": 1991,
  "شہر": 1992,
  "شہرت": 1993,
  "شہی": 1994,
  "شہید": 1995,
  "شۂ": 1996,
  "شی": 1997,
  "شیخ": 1998,
  "شید": 1999,
  "شیدا": 2000,
  "شیدہ": 2001,
  "شیر": 2002,
  "شیریں": 2003,
  "شیشہ": 2004,
  "شیشۂ": 2005,
  "شیشے": 2006,
  "شیفتہ": 2007,
  "شیو": 2008,
  "شیوۂ": 2009,
  "شیں": 2010,
  "شے": 2011,
  "ص": 2012,
  "صاح": 2013,
  "صاحب": 2014,
  "صاف": 2015,
  "صبا": 2016,
  "صبح": 2017,
  "صبر": 2018,
  "صت": 2019,
  "صح": 2020,
  "صحبت": 2021,
  "صحرا": 2022,
  "صحرائے": 2023,
  "صحن": 2024,
  "صد": 2025,
  "صدا": 2026,
  "صدائیں": 2027,
  "صدائے": 2028,
  "صدف": 2029,
  "صدق": 2030,
  "صدم": 2031,
  "صدی": 2032,
  "صدیوں": 2033,
  "صر": 2034,
  "صرف": 2035,
  "صف": 2036,
  "صفا": 2037,
  "صفائی": 2038,
  "صفات": 2039,
  "صفت": 2040,
  "صل": 2041,
  "صلہ": 2042,
  "صلی": 2043,
  "صلیب": 2044,
  "صلے": 2045,
  "صن": 2046,
  "صندل": 2047,
  "صنم": 2048,
  "صو": 2049,
  "صور": 2050,
  "صورت": 2051,
  "صوفی": 2052,
  "صہ": 2053,
  "صہبا": 2054,
  "صی": 2055,
  "صیاد": 2056,
  "صید": 2057,
  "صیر": 2058,
  "صے": 2059,
  "ض": 2060,
  "ضا": 2061,
  "ضب": 2062,
  "ضبط": 2063,
  "ضد": 2064,
  "ضر": 2065,
  "ضرر": 2066,
  "ضرو": 2067,
  "ضرور": 2068,
  "ضرورت": 2069,
  "ضروری": 2070,
  "ضع": 2071,
  "ضعف": 2072,
  "ضمیر": 2073,
  "ضی": 2074,
  "ط": 2075,
  "طا": 2076,
  "طاؤ": 2077,
  "طاؤس": 2078,
  "طائ": 2079,
  "طائر": 2080,
  "طاعت": 2081,
  "طاق": 2082,
  "طاقت": 2083,
  "طال": 2084,
  "طالب": 2085,
  "طالع": 2086,
  "طبع": 2087,
  "طبی": 2088,
  "طبیعت": 2089,
  "طر": 2090,
  "طرب": 2091,
  "طرح": 2092,
  "طرز": 2093,
  "طرف": 2094,
  "طرفہ": 2095,
  "طرۂ": 2096,
  "طری": 2097,
  "طریق": 2098,
  "طع": 2099,
  "طفل": 2100,
  "طق": 2101,
  "طل": 2102,
  "طلب": 2103,
  "طلبی": 2104,
  "طلسم": 2105,
  "طن": 2106,
  "طو": 2107,
  "طواف": 2108,
  "طور": 2109,
  "طوطی": 2110,
  "طوف": 2111,
  "طوفان": 2112,
  "طوفاں": 2113,
  "طوق": 2114,
  "طول": 2115,
  "طہ": 2116,
  "طۂ": 2117,
  "طی": 2118,
  "طے": 2119,
  "ظ": 2120,
  "ظالم": 2121,
  "ظاہر": 2122,
  "ظر": 2123,
  "ظرف": 2124,
  "ظفر": 2125,
  "ظفرؔ": 2126,
  "ظل": 2127,
  "ظلم": 2128,
  "ظلمت": 2129,
  "ظہور": 2130,
  "ع": 2131,
  "عا": 2132,
  "عاجز": 2133,
  "عاد": 2134,
  "عادت": 2135,
  "عار": 2136,
  "عارض": 2137,
  "عاشق": 2138,
  "عاشقی": 2139,
  "عاف": 2140,
  "عافیت": 2141,
  "عاق": 2142,
  "عاقبت": 2143,
  "عالم": 2144,
  "عام": 2145,
  "عب": 2146,
  "عباد": 2147,
  "عبادت": 2148,
  "عبار": 2149,
  "عبارت": 2150,
  "عبث": 2151,
  "عبرت": 2152,
  "عت": 2153,
  "عتاب": 2154,
  "عجب": 2155,
  "عجز": 2156,
  "عجم": 2157,
  "عجیب": 2158,
  "عد": 2159,
  "عدا": 2160,
  "عداوت": 2161,
  "عدم": 2162,
  "عدو": 2163,
  "عذ": 2164,
  "عذاب": 2165,
  "عذر": 2166,
  "عر": 2167,
  "عربدہ": 2168,
  "عرش": 2169,
  "عرص": 2170,
  "عرصۂ": 2171,
  "عرض": 2172,
  "عرف": 2173,
  "عرق": 2174,
  "عرو": 2175,
  "عریاں": 2176,
  "عز": 2177,
  "عزت": 2178,
  "عزم": 2179,
  "عزی": 2180,
  "عزیز": 2181,
  "عش": 2182,
  "عشاق": 2183,
  "عشر": 2184,
  "عشرت": 2185,
  "عشق": 2186,
  "عص": 2187,
  "عطا": 2188,
  "عظ": 2189,
  "عق": 2190,
  "عقبیٰ": 2191,
  "عقدۂ": 2192,
  "عقل": 2193,
  "عقی": 2194,
  "عل": 2195,
  "علا": 2196,
  "علاج": 2197,
  "علم": 2198,
  "علی": 2199,
  "عم": 2200,
  "عمر": 2201,
  "عمل": 2202,
  "عن": 2203,
  "عنا": 2204,
  "عناں": 2205,
  "عنایت": 2206,
  "عندلی": 2207,
  "عندلیب": 2208,
  "عنو": 2209,
  "عنوان": 2210,
  "عنواں": 2211,
  "عون": 2212,
  "عکس": 2213,
  "عہ": 2214,
  "عہد": 2215,
  "عی": 2216,
  "عیار": 2217,
  "عیاں": 2218,
  "عیب": 2219,
  "عید": 2220,
  "عیسیٰ": 2221,
  "عیش": 2222,
  "عین": 2223,
  "غ": 2224,
  "غا": 2225,
  "غارت": 2226,
  "غاف": 2227,
  "غافل": 2228,
  "غالب": 2229,
  "غالبؔ": 2230,
  "غاں": 2231,
  "غبار": 2232,
  "غت": 2233,
  "غذ": 2234,
  "غر": 2235,
  "غربت": 2236,
  "غرض": 2237,
  "غرق": 2238,
  "غرور": 2239,
  "غری": 2240,
  "غریب": 2241,
  "غز": 2242,
  "غزال": 2243,
  "غزل": 2244,
  "غش": 2245,
  "غضب": 2246,
  "غفل": 2247,
  "غفلت": 2248,
  "غل": 2249,
  "غلام": 2250,
  "غلط": 2251,
  "غم": 2252,
  "غمزہ": 2253,
  "غمگیں": 2254,
  "غنچ": 2255,
  "غنچہ": 2256,
  "غنچۂ": 2257,
  "غنچے": 2258,
  "غنی": 2259,
  "غنیمت": 2260,
  "غور": 2261,
  "غیر": 2262,
  "غیرت": 2263,
  "غیروں": 2264,
  "ف": 2265,
  "فا": 2266,
  "فائ": 2267,
  "فائدہ": 2268,
  "فات": 2269,
  "فار": 2270,
  "فاصلہ": 2271,
  "فاصلے": 2272,
  "فاظ": 2273,
  "فاق": 2274,
  "فال": 2275,
  "فام": 2276,
  "فانی": 2277,
  "فت": 2278,
  "فتار": 2279,
  "فتح": 2280,
  "فتنہ": 2281,
  "فتنۂ": 2282,
  "فتنے": 2283,
  "فتہ": 2284,
  "فخر": 2285,
  "فدا": 2286,
  "فر": 2287,
  "فرا": 2288,
  "فراز": 2289,
  "فرازؔ": 2290,
  "فراغت": 2291,
  "فراق": 2292,
  "فراقؔ": 2293,
  "فرد": 2294,
  "فردا": 2295,
  "فردوس": 2296,
  "فرش": 2297,
  "فرشتوں": 2298,
  "فرصت": 2299,
  "فرض": 2300,
  "فرق": 2301,
  "فرقت": 2302,
  "فرما": 2303,
  "فرمائیے": 2304,
  "فرنگ": 2305,
  "فرو": 2306,
  "فروز": 2307,
  "فروزاں": 2308,
  "فروش": 2309,
  "فروغ": 2310,
  "فرہا": 2311,
  "فرہاد": 2312,
  "فری": 2313,
  "فریاد": 2314,
  "فریب": 2315,
  "فزا": 2316,
  "فس": 2317,
  "فسانا": 2318,
  "فسانہ": 2319,
  "فسانے": 2320,
  "فسر": 2321,
  "فسوں": 2322,
  "فشانی": 2323,
  "فشاں": 2324,
  "فصل": 2325,
  "فض": 2326,
  "فضا": 2327,
  "فضاؤں": 2328,
  "فضائیں": 2329,
  "فطر": 2330,
  "فطرت": 2331,
  "فع": 2332,
  "فغاں": 2333,
  "فق": 2334,
  "فقط": 2335,
  "فقیر": 2336,
  "فقیروں": 2337,
  "فل": 2338,
  "فلک": 2339,
  "فن": 2340,
  "فنا": 2341,
  "فو": 2342,
  "فکر": 2343,
  "فگار": 2344,
  "فہ": 2345,
  "فہم": 2346,
  "فی": 2347,
  "فیصلہ": 2348,
  "فیض": 2349,
  "فیضؔ": 2350,
  "فیق": 2351,
  "ق": 2352,
  "قا": 2353,
  "قائل": 2354,
  "قائم": 2355,
  "قاب": 2356,
  "قابل": 2357,
  "قابو": 2358,
  "قات": 2359,
  "قاتل": 2360,
  "قاصد": 2361,
  "قاف": 2362,
  "قافلہ": 2363,
  "قافلے": 2364,
  "قالب": 2365,
  "قامت": 2366,
  "قب": 2367,
  "قبا": 2368,
  "قبر": 2369,
  "قبل": 2370,
  "قبول": 2371,
  "قت": 2372,
  "قتل": 2373,
  "قد": 2374,
  "قدح": 2375,
  "قدر": 2376,
  "قدرت": 2377,
  "قدم": 2378,
  "قدموں": 2379,
  "قر": 2380,
  "قرار": 2381,
  "قراری": 2382,
  "قرب": 2383,
  "قربان": 2384,
  "قربت": 2385,
  "قربتیں": 2386,
  "قرض": 2387,
  "قریب": 2388,
  "قسم": 2389,
  "قسمت": 2390,
  "قص": 2391,
  "قصد": 2392,
  "قصر": 2393,
  "قصور": 2394,
  "قصہ": 2395,
  "قضا": 2396,
  "قط": 2397,
  "قطرہ": 2398,
  "قطرۂ": 2399,
  "قطع": 2400,
  "قفس": 2401,
  "قل": 2402,
  "قلب": 2403,
  "قلزم": 2404,
  "قلم": 2405,
  "قمر": 2406,
  "قمری": 2407,
  "قوت": 2408,
  "قول": 2409,
  "قہ": 2410,
  "قہر": 2411,
  "قی": 2412,
  "قیا": 2413,
  "قیامت": 2414,
  "قید": 2415,
  "قیس": 2416,
  "قیمت": 2417,
  "قے": 2418,
  "ل": 2419,
  "لئے": 2420,
  "لا": 2421,
  "لائی": 2422,
  "لائیں": 2423,
  "لائے": 2424,
  "لات": 2425,
  "لاتا": 2426,
  "لازم": 2427,
  "لاش": 2428,
  "لال": 2429,
  "لالہ": 2430,
  "لام": 2431,
  "لانا": 2432,
  "لانے": 2433,
  "لاوے": 2434,
  "لاک": 2435,
  "لاکھ": 2436,
  "لاکھوں": 2437,
  "لایا": 2438,
  "لب": 2439,
  "لباس": 2440,
  "لبریز": 2441,
  "لبوں": 2442,
  "لبی": 2443,
  "لت": 2444,
  "لحا": 2445,
  "لحاظ": 2446,
  "لحد": 2447,
  "لخت": 2448,
  "لذ": 2449,
  "لذت": 2450,
  "لرز": 2451,
  "لشکر": 2452,
  "لط": 2453,
  "لطف": 2454,
  "لعل": 2455,
  "لغز": 2456,
  "لف": 2457,
  "لفظ": 2458,
  "لفظوں": 2459,
  "لم": 2460,
  "لمح": 2461,
  "لمحوں": 2462,
  "لمحہ": 2463,
  "لمحے": 2464,
  "لو": 2465,
  "لوب": 2466,
  "لوح": 2467,
  "لوم": 2468,
  "لوٹ": 2469,
  "لوک": 2470,
  "لوگ": 2471,
  "لوگوں": 2472,
  "لوں": 2473,
  "لٹ": 2474,
  "لٹا": 2475,
  "لپ": 2476,
  "لپٹ": 2477,
  "لچ": 2478,
  "لچک": 2479,
  "لڑ": 2480,
  "لڑکا": 2481,
  "لکھ": 2482,
  "لکھا": 2483,
  "لکھتا": 2484,
  "لکھتے": 2485,
  "لکھن": 2486,
  "لکھنؤ": 2487,
  "لکھنا": 2488,
  "لکھوں": 2489,
  "لکھے": 2490,
  "لکی": 2491,
  "لگ": 2492,
  "لگا": 2493,
  "لگائیں": 2494,
  "لگائے": 2495,
  "لگاتے": 2496,
  "لگانا": 2497,
  "لگانے": 2498,
  "لگتا": 2499,
  "لگتی": 2500,
  "لگتے": 2501,
  "لگی": 2502,
  "لگیں": 2503,
  "لگے": 2504,
  "لہ": 2505,
  "لہجہ": 2506,
  "لہجے": 2507,
  "لہر": 2508,
  "لہو": 2509,
  "لی": 2510,
  "لیا": 2511,
  "لیتا": 2512,
  "لیتی": 2513,
  "لیتے": 2514,
  "لیجئے": 2515,
  "لیف": 2516,
  "لیل": 2517,
  "لیلیٰ": 2518,
  "لیم": 2519,
  "لینا": 2520,
  "لینے": 2521,
  "لیٰ": 2522,
  "لیکن": 2523,
  "لیں": 2524,
  "لیے": 2525,
  "لیے<eos>": 2526,
  "لے": 2527,
  "م": 2528,
  "مآ": 2529,
  "مآل": 2530,
  "مئ": 2531,
  "مئے": 2532,
  "ما": 2533,
  "مائل": 2534,
  "مات": 2535,
  "ماتم": 2536,
  "ماتھے": 2537,
  "ماج": 2538,
  "ماجرا": 2539,
  "مار": 2540,
  "مارا": 2541,
  "مارے": 2542,
  "ماضی": 2543,
  "مال": 2544,
  "مان": 2545,
  "مانا": 2546,
  "مانتا": 2547,
  "ماندہ": 2548,
  "مانع": 2549,
  "مانند": 2550,
  "مانوس": 2551,
  "مانگ": 2552,
  "مانگے": 2553,
  "مانی": 2554,
  "مانے": 2555,
  "ماں": 2556,
  "ماہ": 2557,
  "ماہتاب": 2558,
  "مای": 2559,
  "مایوس": 2560,
  "مبار": 2561,
  "مبارک": 2562,
  "مبتلا": 2563,
  "مت": 2564,
  "متا": 2565,
  "متاع": 2566,
  "مث": 2567,
  "مثال": 2568,
  "مثل": 2569,
  "مج": 2570,
  "مجب": 2571,
  "مجبور": 2572,
  "مجبوری": 2573,
  "مجسم": 2574,
  "مجلس": 2575,
  "مجمع": 2576,
  "مجنوں": 2577,
  "مجھ": 2578,
  "مجھی": 2579,
  "مجھے": 2580,
  "مجھے<eos>": 2581,
  "مح": 2582,
  "محاب": 2583,
  "محابا": 2584,
  "محال": 2585,
  "محبت": 2586,
  "محبتوں": 2587,
  "محبو": 2588,
  "محبوب": 2589,
  "محت": 2590,
  "محتسب": 2591,
  "محرم": 2592,
  "محرو": 2593,
  "محروم": 2594,
  "محرومی": 2595,
  "محسن": 2596,
  "محسنؔ": 2597,
  "محسوس": 2598,
  "محشر": 2599,
  "محفل": 2600,
  "محل": 2601,
  "محمل": 2602,
  "محنت": 2603,
  "محو": 2604,
  "محی": 2605,
  "محیط": 2606,
  "مخت": 2607,
  "مختصر": 2608,
  "مد": 2609,
  "مدا": 2610,
  "مدام": 2611,
  "مدت": 2612,
  "مدتوں": 2613,
  "مدح": 2614,
  "مدد": 2615,
  "مدعا": 2616,
  "مدعی": 2617,
  "مذ": 2618,
  "مذہ": 2619,
  "مذہب": 2620,
  "مر": 2621,
  "مرا": 2622,
  "مراد": 2623,
  "مراسم": 2624,
  "مرتا": 2625,
  "مرتے": 2626,
  "مرح": 2627,
  "مرحبا": 2628,
  "مرد": 2629,
  "مردم": 2630,
  "مرض": 2631,
  "مرغ": 2632,
  "مرنا": 2633,
  "مرنے": 2634,
  "مرو": 2635,
  "مروت": 2636,
  "مرگ": 2637,
  "مرہم": 2638,
  "مری": 2639,
  "مریض": 2640,
  "مرے": 2641,
  "مزا": 2642,
  "مزاج": 2643,
  "مزار": 2644,
  "مزہ": 2645,
  "مزے": 2646,
  "مس": 2647,
  "مسئ": 2648,
  "مسئلہ": 2649,
  "مسا": 2650,
  "مسافر": 2651,
  "مست": 2652,
  "مستانہ": 2653,
  "مستی": 2654,
  "مسجد": 2655,
  "مسرت": 2656,
  "مسل": 2657,
  "مسلسل": 2658,
  "مسلماں": 2659,
  "مسک": 2660,
  "مسکر": 2661,
  "مسکرا": 2662,
  "مسی": 2663,
  "مسیحا": 2664,
  "مسیحائی": 2665,
  "مش": 2666,
  "مشت": 2667,
  "مشتا": 2668,
  "مشتاق": 2669,
  "مشر": 2670,
  "مشرب": 2671,
  "مشق": 2672,
  "مشک": 2673,
  "مشکل": 2674,
  "مشہور": 2675,
  "مشی": 2676,
  "مشیت": 2677,
  "مص": 2678,
  "مصح": 2679,
  "مصحفی": 2680,
  "مصحفیؔ": 2681,
  "مصر": 2682,
  "مصرو": 2683,
  "مصروف": 2684,
  "مصل": 2685,
  "مصلحت": 2686,
  "مصور": 2687,
  "مصی": 2688,
  "مصیبت": 2689,
  "مض": 2690,
  "مضا": 2691,
  "مضموں": 2692,
  "مط": 2693,
  "مطرب": 2694,
  "مطل": 2695,
  "مطلب": 2696,
  "مطلق": 2697,
  "مع": 2698,
  "معاف": 2699,
  "معام": 2700,
  "معاملہ": 2701,
  "معانی": 2702,
  "معذ": 2703,
  "معذور": 2704,
  "معشوق": 2705,
  "معصو": 2706,
  "معصوم": 2707,
  "معلوم": 2708,
  "معمور": 2709,
  "معنی": 2710,
  "مغ": 2711,
  "مغاں": 2712,
  "مغر": 2713,
  "مغرور": 2714,
  "مفت": 2715,
  "مفل": 2716,
  "مق": 2717,
  "مقابل": 2718,
  "مقام": 2719,
  "مقتل": 2720,
  "مقدر": 2721,
  "مقدم": 2722,
  "مقصد": 2723,
  "مقصو": 2724,
  "مقصود": 2725,
  "مل": 2726,
  "ملا": 2727,
  "ملاقات": 2728,
  "ملال": 2729,
  "ملامت": 2730,
  "ملتا": 2731,
  "ملتی": 2732,
  "ملتے": 2733,
  "ملنا": 2734,
  "ملنے": 2735,
  "ملو": 2736,
  "ملک": 2737,
  "ملی": 2738,
  "ملیں": 2739,
  "ملے": 2740,
  "مم": 2741,
  "ممن": 2742,
  "ممکن": 2743,
  "من": 2744,
  "منا": 2745,
  "منت": 2746,
  "منتظر": 2747,
  "مند": 2748,
  "مندر": 2749,
  "مندی": 2750,
  "منزل": 2751,
  "منزلوں": 2752,
  "منزلیں": 2753,
  "منسو": 2754,
  "منسوب": 2755,
  "منص": 2756,
  "منظ": 2757,
  "منظر": 2758,
  "منظور": 2759,
  "منکر": 2760,
  "منہ": 2761,
  "منیں": 2762,
  "مو": 2763,
  "موئے": 2764,
  "موت": 2765,
  "موتی": 2766,
  "موج": 2767,
  "موجود": 2768,
  "موجۂ": 2769,
  "مور": 2770,
  "موز": 2771,
  "موسم": 2772,
  "موسیٰ": 2773,
  "موق": 2774,
  "مول": 2775,
  "مولا": 2776,
  "موڑ": 2777,
  "موں": 2778,
  "مٹ": 2779,
  "مٹا": 2780,
  "مٹھی": 2781,
  "مٹی": 2782,
  "مچل": 2783,
  "مڑ": 2784,
  "مژ": 2785,
  "مژگان": 2786,
  "مژگاں": 2787,
  "مژہ": 2788,
  "مژۂ": 2789,
  "مک": 2790,
  "مکان": 2791,
  "مکاں": 2792,
  "مکر": 2793,
  "مکرر": 2794,
  "مکھ": 2795,
  "مکیں": 2796,
  "مگر": 2797,
  "مہ": 2798,
  "مہتاب": 2799,
  "مہر": 2800,
  "مہربان": 2801,
  "مہربانی": 2802,
  "مہرباں": 2803,
  "مہلت": 2804,
  "مہم": 2805,
  "مہمان": 2806,
  "مہماں": 2807,
  "مہک": 2808,
  "مہکی": 2809,
  "مہکے": 2810,
  "مہی": 2811,
  "مۂ": 2812,
  "می": 2813,
  "میاں": 2814,
  "میدان": 2815,
  "میداں": 2816,
  "میر": 2817,
  "میرؔ": 2818,
  "میرا": 2819,
  "میرا<eos>": 2820,
  "میری": 2821,
  "میرے": 2822,
  "میز": 2823,
  "میل": 2824,
  "مینا": 2825,
  "مینائے": 2826,
  "میکدے": 2827,
  "میں": 2828,
  "میں<eos>": 2829,
  "مے": 2830,
  "ن": 2831,
  "نئی": 2832,
  "نئیں": 2833,
  "نئے": 2834,
  "نا": 2835,
  "ناب": 2836,
  "ناتمام": 2837,
  "ناتو": 2838,
  "ناتوانی": 2839,
  "ناتواں": 2840,
  "ناجی": 2841,
  "ناجیؔ": 2842,
  "ناخدا": 2843,
  "ناخن": 2844,
  "نادان": 2845,
  "نادانی": 2846,
  "ناداں": 2847,
  "نار": 2848,
  "نارسا": 2849,
  "ناز": 2850,
  "نازنیں": 2851,
  "نازک": 2852,
  "ناشاد": 2853,
  "ناص": 2854,
  "ناصح": 2855,
  "ناف": 2856,
  "نال": 2857,
  "نالہ": 2858,
  "نالۂ": 2859,
  "نالے": 2860,
  "نام": 2861,
  "نامو": 2862,
  "ناموس": 2863,
  "نامہ": 2864,
  "ناوک": 2865,
  "ناچ": 2866,
  "ناچار": 2867,
  "ناک": 2868,
  "ناکام": 2869,
  "ناکامی": 2870,
  "ناگہ": 2871,
  "ناگہاں": 2872,
  "ناں": 2873,
  "نب": 2874,
  "نباہ": 2875,
  "نبض": 2876,
  "نبھ": 2877,
  "نبھا": 2878,
  "نت": 2879,
  "نثار": 2880,
  "نج": 2881,
  "نجات": 2882,
  "نخ": 2883,
  "نخل": 2884,
  "ند": 2885,
  "ندا": 2886,
  "ندامت": 2887,
  "ندھ": 2888,
  "ندھی": 2889,
  "ندہ": 2890,
  "ندی": 2891,
  "ندیم": 2892,
  "ندے": 2893,
  "نذر": 2894,
  "نرا": 2895,
  "نرم": 2896,
  "نرگ": 2897,
  "نرگس": 2898,
  "نز": 2899,
  "نزاک": 2900,
  "نزاکت": 2901,
  "نزدی": 2902,
  "نزدیک": 2903,
  "نزع": 2904,
  "نس": 2905,
  "نسب": 2906,
  "نسبت": 2907,
  "نسخ": 2908,
  "نسیم": 2909,
  "نش": 2910,
  "نشا": 2911,
  "نشاط": 2912,
  "نشان": 2913,
  "نشانی": 2914,
  "نشاں": 2915,
  "نشتر": 2916,
  "نشہ": 2917,
  "نشۂ": 2918,
  "نشی": 2919,
  "نشیمن": 2920,
  "نشیں": 2921,
  "نشے": 2922,
  "نصی": 2923,
  "نصیب": 2924,
  "نصیر": 2925,
  "نصیرؔ": 2926,
  "نظ": 2927,
  "نظارہ": 2928,
  "نظارۂ": 2929,
  "نظارے": 2930,
  "نظر": 2931,
  "نظروں": 2932,
  "نظریں": 2933,
  "نظم": 2934,
  "نظمؔ": 2935,
  "نغم": 2936,
  "نغمہ": 2937,
  "نغمۂ": 2938,
  "نغمے": 2939,
  "نفر": 2940,
  "نفرت": 2941,
  "نفس": 2942,
  "نق": 2943,
  "نقاب": 2944,
  "نقد": 2945,
  "نقش": 2946,
  "نقشہ": 2947,
  "نقص": 2948,
  "نم": 2949,
  "نما": 2950,
  "نماز": 2951,
  "نمایاں": 2952,
  "نمرو": 2953,
  "نمرود": 2954,
  "نمو": 2955,
  "نمود": 2956,
  "نمک": 2957,
  "نمی": 2958,
  "ننگ": 2959,
  "نو": 2960,
  "نوا": 2961,
  "نوائی": 2962,
  "نوائے": 2963,
  "نواز": 2964,
  "نوحہ": 2965,
  "نور": 2966,
  "نومی": 2967,
  "نومیدی": 2968,
  "نوک": 2969,
  "نوں": 2970,
  "نوید": 2971,
  "نٹ": 2972,
  "نچ": 2973,
  "نچا": 2974,
  "نڈ": 2975,
  "نڈھ": 2976,
  "نک": 2977,
  "نکا": 2978,
  "نکال": 2979,
  "نکالے": 2980,
  "نکتہ": 2981,
  "نکل": 2982,
  "نکلا": 2983,
  "نکلتی": 2984,
  "نکلتے": 2985,
  "نکلنے": 2986,
  "نکلی": 2987,
  "نکلیں": 2988,
  "نکلے": 2989,
  "نکلے<eos>": 2990,
  "نکھ": 2991,
  "نکھر": 2992,
  "نکہ": 2993,
  "نکہت": 2994,
  "نگ": 2995,
  "نگا": 2996,
  "نگار": 2997,
  "نگاہ": 2998,
  "نگاہوں": 2999,
  "نگاہی": 3000,
  "نگاہیں": 3001,
  "نگر": 3002,
  "نگری": 3003,
  "نگہ": 3004,
  "نگۂ": 3005,
  "نگی": 3006,
  "نہ": 3007,
  "نہا": 3008,
  "نہار": 3009,
  "نہانی": 3010,
  "نہاں": 3011,
  "نہایت": 3012,
  "نہیں": 3013,
  "نہیں<eos>": 3014,
  "نۂ": 3015,
  "نی": 3016,
  "نیا": 3017,
  "نیاز": 3018,
  "نیازی": 3019,
  "نیت": 3020,
  "نیرنگ": 3021,
  "نیم": 3022,
  "نین": 3023,
  "نیند": 3024,
  "نیک": 3025,
  "نیں": 3026,
  "نے": 3027,
  "نے<eos>": 3028,
  "و": 3029,
  "وا": 3030,
  "وائے": 3031,
  "واب": 3032,
  "وابستہ": 3033,
  "واد": 3034,
  "وادی": 3035,
  "وار": 3036,
  "واردات": 3037,
  "واری": 3038,
  "واز": 3039,
  "واس": 3040,
  "واسطے": 3041,
  "واعظ": 3042,
  "واف": 3043,
  "واق": 3044,
  "واقعہ": 3045,
  "واقف": 3046,
  "وال": 3047,
  "والا": 3048,
  "والو": 3049,
  "والوں": 3050,
  "والی": 3051,
  "والے": 3052,
  "وام": 3053,
  "واماند": 3054,
  "وانہ": 3055,
  "واپ": 3056,
  "واں": 3057,
  "واہ": 3058,
  "وب": 3059,
  "وبال": 3060,
  "وت": 3061,
  "وجد": 3062,
  "وجود": 3063,
  "وجہ": 3064,
  "وح": 3065,
  "وحشت": 3066,
  "وحشی": 3067,
  "ود": 3068,
  "ودا": 3069,
  "وداع": 3070,
  "ور": 3071,
  "ورا": 3072,
  "ورق": 3073,
  "ورنہ": 3074,
  "وری": 3075,
  "وز": 3076,
  "وس": 3077,
  "وسعت": 3078,
  "وسعتیں": 3079,
  "وسی": 3080,
  "وسیم": 3081,
  "وسیمؔ": 3082,
  "وش": 3083,
  "وشی": 3084,
  "وص": 3085,
  "وصال": 3086,
  "وصف": 3087,
  "وصل": 3088,
  "وض": 3089,
  "وضع": 3090,
  "وطن": 3091,
  "وع": 3092,
  "وعدہ": 3093,
  "وعدۂ": 3094,
  "وعدے": 3095,
  "وف": 3096,
  "وفا": 3097,
  "وفائی": 3098,
  "وق": 3099,
  "وقت": 3100,
  "وقف": 3101,
  "ول": 3102,
  "ولو": 3103,
  "ولولے": 3104,
  "ولی": 3105,
  "ولیؔ": 3106,
  "ولے": 3107,
  "وم": 3108,
  "ون": 3109,
  "وند": 3110,
  "وو": 3111,
  "ووں": 3112,
  "وٹ": 3113,
  "وٹا": 3114,
  "وک": 3115,
  "وگر": 3116,
  "وگرنہ": 3117,
  "وں": 3118,
  "وہ": 3119,
  "وہاں": 3120,
  "وہر": 3121,
  "وہم": 3122,
  "وہی": 3123,
  "وہیں": 3124,
  "وی": 3125,
  "وید": 3126,
  "ویر": 3127,
  "ویران": 3128,
  "ویرانہ": 3129,
  "ویرانی": 3130,
  "ویرانے": 3131,
  "ویراں": 3132,
  "ویسا": 3133,
  "ویسی": 3134,
  "ویسے": 3135,
  "ویش": 3136,
  "ویں": 3137,
  "وے": 3138,
  "ي": 3139,
  "يں": 3140,
  "ً": 3141,
  "ٔ": 3142,
  "ٰ": 3143,
  "ٹ": 3144,
  "ٹا": 3145,
  "ٹان": 3146,
  "ٹل": 3147,
  "ٹوٹ": 3148,
  "ٹوٹا": 3149,
  "ٹوٹی": 3150,
  "ٹوٹے": 3151,
  "ٹوں": 3152,
  "ٹپ": 3153,
  "ٹپک": 3154,
  "ٹک": 3155,
  "ٹکا": 3156,
  "ٹکرا": 3157,
  "ٹکڑے": 3158,
  "ٹھ": 3159,
  "ٹھا": 3160,
  "ٹھنڈ": 3161,
  "ٹھو": 3162,
  "ٹھوکر": 3163,
  "ٹھک": 3164,
  "ٹھکانا": 3165,
  "ٹھکانے": 3166,
  "ٹھہ": 3167,
  "ٹھہر": 3168,
  "ٹھہرا": 3169,
  "ٹھہری": 3170,
  "ٹھہرے": 3171,
  "ٹھی": 3172,
  "ٹی": 3173,
  "ٹے": 3174,
  "پ": 3175,
  "پئے": 3176,
  "پا": 3177,
  "پاؤ": 3178,
  "پاؤں": 3179,
  "پائی": 3180,
  "پائیں": 3181,
  "پائے": 3182,
  "پاب": 3183,
  "پابند": 3184,
  "پاتا": 3185,
  "پاتے": 3186,
  "پار": 3187,
  "پارسائی": 3188,
  "پارہ": 3189,
  "پارۂ": 3190,
  "پاس": 3191,
  "پاش": 3192,
  "پان": 3193,
  "پانچ": 3194,
  "پانی": 3195,
  "پاک": 3196,
  "پاگل": 3197,
  "پایا": 3198,
  "پت": 3199,
  "پتا": 3200,
  "پتوں": 3201,
  "پتھر": 3202,
  "پتھروں": 3203,
  "پتہ": 3204,
  "پتے": 3205,
  "پر": 3206,
  "پر<eos>": 3207,
  "پرانا": 3208,
  "پرانی": 3209,
  "پرانے": 3210,
  "پرتو": 3211,
  "پردہ": 3212,
  "پردۂ": 3213,
  "پردے": 3214,
  "پرس": 3215,
  "پرست": 3216,
  "پرستش": 3217,
  "پرستی": 3218,
  "پرسش": 3219,
  "پرندے": 3220,
  "پرو": 3221,
  "پروا": 3222,
  "پرواز": 3223,
  "پروانہ": 3224,
  "پرور": 3225,
  "پرچھا": 3226,
  "پرہی": 3227,
  "پرہیز": 3228,
  "پری": 3229,
  "پریشان": 3230,
  "پریشانی": 3231,
  "پریشاں": 3232,
  "پس": 3233,
  "پسند": 3234,
  "پشت": 3235,
  "پشی": 3236,
  "پشیماں": 3237,
  "پل": 3238,
  "پلا": 3239,
  "پلٹ": 3240,
  "پلک": 3241,
  "پلکوں": 3242,
  "پلکیں": 3243,
  "پن": 3244,
  "پنا": 3245,
  "پناہ": 3246,
  "پنبہ": 3247,
  "پنج": 3248,
  "پنجۂ": 3249,
  "پند": 3250,
  "پنہاں": 3251,
